{"tweets": ["The ongoing pandemic has highlighted the importance of your in-home Wi-Fi connection. \n\nBut what is the next generation of Wi-Fi all about? \n\nLearn how Wi-Fi 6 will impact your home connection: https://nokia.ly/2WPzeh7 ", "As we are strongly committed to delivering the most robust network infrastructures possible, we are proud to announce our collaboration with @Microsoft as part of the SONiC initiative. https://nokia.ly/35UjlKL ", "The city of Wroclaw, Poland is using our #smartcity platform to deliver connected care for older adults, improve public transit and city mobility, and strengthen emergency response. https://nokia.ly/3fCKCpc  #NokiaInnovates", "In today's #livestream our #Deepfield team will share insights on the macro-effects that the #COVID19 pandemic has caused to the network - and how CSPs reacted to this change. Mark your calendars and join us to learn more: https://nokia.ly/3fC0t7v ", "#COVID19 insights - and beyond. Three of our experts are going live on May 12 to share first-hand insights on latest #Deepfield findings related to the lock-down. Save the date and join our team next Tuesday. https://nokia.ly/2YVWoW7 ", "We are humbled to be announced as Finland's most valuable brand for the fifth consecutive year, according to @BrandFinance - particularly in the unprecedented times that the world is currently in. https://nokia.ly/3bdv3RJ ", "We're proud to be working with @ExteNetSystems and @Cal_net to bring one of the first deployments of CBRS technology in the U.S. to rural California. Read more about our collaboration here: https://nokia.ly/3fwjWX9 ", "Harnessing the power of tech to save lives while protecting human rights is fundamental to who we are at Nokia. Read a blog by Rajeev Suri on how we conduct ourselves, including results of an assessment as part of our board membership of the @theGNI: https://nokia.ly/3fuDb3y ", "We are committed to support #Loon’s mission in delivering #connectivity to people in unserved and underserved communities around the world with our innovations for high-altitude network technology. #NokiaInnovates https://nokia.ly/3fAkwDw ", "Look to the skies to bridge the divide, our Tamas Makay on high altitude platforms, and #connectivity. https://nokia.ly/2W9LVo0  #NokiaInnovates #Loon", "We partner with @ABIresearch in a survey of more than 600 #manufacturing decision-makers across nine major markets, to assess investment strategies related to 4G/LTE, #5G and Industry 4.0. Read more: https://nokia.ly/35zTszy ", "Raghav Sahgal appointed President of Nokia Enterprise and a member of the Nokia Group Leadership Team https://nokia.ly/2KZagGP ", "We’re proud to bring our end-to-end #5G solutions to @TMobile's nationwide RAN network and 5G Standalone core. These inherent cloud-native features and micro-service capabilities will enable exciting new use cases for real-time latency and massive connectivity.", "We are proud to work with @TMobile together with other global companies to accomplish a series of standalone (SA) #5G World Firsts, signalling end-to-end readiness. https://nokia.ly/3aXi6ew ", "To enhance #5G network coverage, improve the indoor experience, and deliver high-speed connectivity to customers where VHA is making 5G available, today we announce the first low-band NR700mhz deployment in a field test environment in APAC alongside @VodafoneAU.", "To avoid data bottlenecks, operator capacity is being boosted to account for an increase in technology usage at home. Our Rajeev Suri spoke to Bloomberg about how this is affecting our work.", "Telecommunications have never been more critical to the global economy. We join the @b20 and @S20_G20 appeal to the G20 leaders for immediate action in areas such as strengthening the digital infrastructure, and improving #cybersecurity.\n\n#COVID19", "See all the materials you need to find out more about our Q1 2020 results here: https://nokia.ly/2SkRptD  $NOK", "Rajeev Suri discusses our Q1 2020 earnings and the impact of the coronavirus crisis with @SquawkBoxEurope\nhttps://nokia.ly/3feCOKm  #COVID19 $NOK", "We announce first quarter 2020 results. Our solid Q1 results showed broad year-on-year profitability improvements as our transformation & product cost reduction efforts started to take hold. Read the PR https://nokia.ly/3cUxsSm  & see investor website https://nokia.ly/2W4BTmI . $NOK", "We're thrilled to be among HAPS Alliance members that have outlined untapped commercial opportunities for Earth’s stratosphere that spans telco, high-resolution earth observation, weather prediction, and modeling. Read more about Alphabet’s #ProjectLoon: https://nokia.ly/3cXIJRP ", "Our Rajeev Suri says: World Day for Safety and Health at Work comes at a unique moment. As governments start lifting #COVID19 lockdowns, we have never been more aware of the importance of staying safe in the workplace. #Industry40 can help - here's how. https://nokia.ly/2SenpQp ", "Curious about audio zooming? This @DxOMark article is a great read that helps demystify the technology and references our own Audio Zoom as an example of how effective this technology can be in the real world. https://nokia.ly/3cZ7Y6w  #OZOAudio #NokiaOZO", "See how we help cable operators build networks that address the service delivery and subscriber demands of today and tomorrow: https://nokia.ly/3bg3Azt ", "We are committed to improving lives of local communities in various fields in South Africa. As part of our #CSR helping hands programs we have launched an educational initiative with Got Game and @RoboticalLtd for disadvantaged youths. https://nokia.ly/2Y99zT4  #africasgotgame", "Our Rajeev Suri says: World Day for Safety and Health at Work comes at a unique moment. As governments start lifting #COVID19 lockdowns, we have never been more aware of the importance of staying safe in the workplace. #Industry40 can help - here's how. https://nokia.ly/2SenpQp ", "To boost network capacity and improve customer experience, we sign a a multi-year agreement with Bharti Airtel to deploy Nokia SRAN solution in India. The rollout will also lay the foundation for providing future #5G connectivity. https://nokia.ly/2YcKK8U  #4G @airtelnews", "Our Annual General Meeting will be held on Wednesday May 27, 2020. See instructions for participation and advance voting here: https://nokia.ly/2y1QTKh  It is not possible to attend the Meeting in person.", "How much do you think application usage grew during lock-down? https://nokia.ly/2VR9P6o  #COVID19", "Let’s work together to realize a zero-emissions future. Rethink, reinvent, reduce.  https://nokia.ly/2VPEhxy  #5G #sustainability #climatechange", "Our Craig Labovitz joined @ITU and @UNSGdigicoop webinar on advancing #digitalcooperation. @TechRepublic reports how governments, telecoms, and tech leaders around the world are grappling with how to handle a surge in demand for internet access. #COVID19", "Small things can make a massive difference when building out #5G. Our chipsets use fewer materials to save space and reduce energy consumption. Find out more about our #sustainability efforts. https://nokia.ly/3eRoIhx  #5G", "Have you been experiencing more lag and connection issues while gaming? \n\nThe drastic increase in online gaming during the pandemic is stressing #WiFi networks, but we’ve got four tips for maximizing your connection. \n\nRead them here: https://nokia.ly/3ayeteM ", "In the spirit of solidarity #TeamNokia Finland proudly participated in the “lunch for children” campaign and donated goods to local organizations. #COVID19 #FeelEngaged #CSR @Hopeyhdistys @Venner49779873", "Meet some of the future career women in #ICT! Let’s stand up for all the girls that consider taking up careers in the tech field. Happy #GirlsInICT day! #GenderEquality #FeelEmpowered", "Let’s work together to realize a zero-emissions future. Rethink, reinvent, reduce.  https://nokia.ly/2yzjg2i  #sustainability #climatechange #EarthDay #5G", " Join @ITU + @HochschildF for a #DigitalCooperation webinar on connectivity best practice during #COVID19 + beyond\n\n 22 April, 15:30-17:00 CET \n\n https://www.itu.int/en/ITU-D/Pages/seminars/2020/DigitalCooperation/default.aspx …", "Today as we celebrate World #EarthDay 2020 we are living through an exceptional time.  Find out how we are meeting the challenge of #climatechange. https://nokia.ly/2wZCMon  #5G", "#COVID19 makes abundantly clear our collective dependence on digital technologies and #connectivity. We are pleased that our Craig Labovitz will join @ITU and @UNSGdigicoop webinar series on advancing #digitalcooperation on 22 April. https://bit.ly/34Qx5FE ", "Keeping our customers connected is important now more than ever. We are proud to be collaborating with @USCellular to deploy expanded #spectrum in markets experiencing increased network traffic as a result of #COVID19. Read more: https://nokia.ly/3bq0lFH ", "Our Rajeev Suri shares his thoughts on @globalcompactFi blog: How do we build a better world after this crisis is over?https://bit.ly/2wTpc5L  @globalcompact #COVID19", "#TeamNokia Romania set out to be an active part of this unprecedented solidarity with the heroes fighting #COVID19 by fundraising to support those in the first line. #FeelEngaged", "Keeping the world connected. Visit our #COVID19 web page to find out insights on how the pandemic is affecting network traffic. Subscribe to our bulletin to get the latest updates delivered straight to your inbox. https://nokia.ly/3cp4OIJ ", "When the #COVID19 pandemic begins to cool, governments will start thinking about how their #healthcare systems coped & how those systems can be improved. It is an immensely complicated question. But connectivity can be part of the answer blogs Rajeev Suri. https://nokia.ly/2yTac8A ", "When you’ll be welcoming friends and family back into your home again, you might notice that a little separation with your #WiFi will help strengthen the relationship. Learn why you should create a guest network. https://nokia.ly/3aeuw1m ", "The current crisis is a challenge to humankind – of that there is no doubt. In the long run, though, @MarcusWeldon believes it will drive scientific, technological and business breakthroughs. #COVID19\n \nRead his newest blog here:  https://bit.ly/3a3anLG ", "In our upcoming #NokiaLive webinar we'll share how operators can alleviate their top 3 #security concerns - that is prevention, identifying, and containing threats once within their networks. Join us for more on Thursday! https://nokia.ly/3adzHi9 \n#5G", "What do you feel are the barriers to deploying a private wireless network? To find out more on this topic, join our 21 April 2020 #NokiaLive webinar: https://nokia.ly/3a3vxsN ", "When the #COVID19 pandemic begin to cool, governments will start thinking about how their #healthcare systems coped & how those systems can be improved. It is an immensely complicated question. But connectivity can be part of the answer blogs Rajeev Suri. https://nokia.ly/2yTac8A ", "Our colleagues in Ulm (Germany) have virtual breakfast together to kick-start the day and remind everyone \nthe importance of reaching out to friends and colleagues to have a cup of coffee and chat. #FeelConnected #TeamNokia #WorkingFromHome", "5G is an important part of fast-forwarding our business and personal lives. For now, we need to endure this pandemic, but as we come out the other side, we have a great ally in #5G. Karl Bream shares his thoughts on our blog. https://nokia.ly/2JXsqs1  #COVID19 #manufacturing", "#TeamNokia Wroclaw (Poland) is up to a new challenge to inspire and motivate each other to take care of their well-being. How do you practice self-care? #FeelConnected", "Here is how the pandemic is affecting network traffic at the weekends: https://nokia.ly/2wA4oAg \n#COVID19", "Join us on a journey to build a more sustainable future for everyone. Better #connectivity can help create a better world for people and the planet. Read a blog post by Rajeev Suri: https://nokia.ly/2JKr6IG  #sustainability #climate #CSR", "Has your Wi-Fi been unreliable lately? \nPro tip: You can improve your connection by moving your router to a higher location, away from electronic devices that may interfere. \nMore tips on how to strengthen your home #WiFi here:\nhttps://nokia.ly/2y2twQy ", "What are the network effects of our changed lives in the time of #COVID19? Read our latest network traffic insights based on Nokia Deepfield: https://nokia.ly/2UVIwZq ", "We are playing our part in the fight against #coronavirus, and support our employees, customers and societies where we operate. #COVID19 https://nokia.ly/3b7bBpN  #TeamNokia", "The climate crisis is real and we need to act. We are committed to do our part for a cleaner, more connected world. Join us! https://nokia.ly/3c5CcnX  #sustainability #climate", "In today's blog, our Karl Bream discusses how #5G has the potential to contribute to a smarter and safer world. https://nokia.ly/3aXRRVZ  #COVID19", "To support mobile operators to deliver compelling 5G experiences to their customers faster and at a lower cost, and to meet with increased demand for capacity, we expand our #5G offering with new radio access AirScale solutions. https://nokia.ly/2RnvQIy  #DSS #cloud", "Keeping the world connected. Visit our #COVID19 web page to find out insights on how the pandemic is affecting network traffic. Subscribe to our bulletin to get the latest updates delivered straight to your inbox. https://nokia.ly/39W2cjY ", "In the spirit of togetherness, #TeamNokia in Spain and Poland are 3D printing protective face shields to donate to health personnel in their fight against #COVID19. #FeelEngaged", "Want to become certified in 5G? By completing 6-hours of web-based learning, and passing the knowledge based exam, you can receive your end-to-end #5G associate certification. Learn more here: https://nokia.ly/2xZ7Ggt  @BellLabs", "As an active member of the @b20 Digitalization Taskforce, we join the call by B20 Saudi Arabia with L20 (Labour 20) and W20 (Women 20) for urgent and coordinated efforts to contain the impact of #COVID19 on the workforce. #WorldHealthDay", "Nurses and other health workers are at the forefront of #COVID19 response. Let's show our appreciation and #StayAtHome. https://bit.ly/34cHyLo  @WHO #WorldHealthDay #SupportNursesAndMidwives", ". @UNBBCom calls for action on #COVID19 towards resilient connectivity, affordable access, and safe and informed Internet use. Read a blog post by Rajeev Suri: \"Keeping the world connected\". https://nokia.ly/2JK2oIG  @ITU #WorldHealthDay https://bit.ly/2RgKSQf ", "Innovative mHealth applications can improve health, nutrition, sanitation & hygiene. @UNICEF applied integrated SMS messaging for child wellbeing in 5 districts in Aceh Province, Indonesia with 6000 direct & 459 730 indirect beneficiaries. https://nokia.ly/3dWx5bj  #WorldHealthDay", "Join us on a journey to build a more sustainable future for everyone. Better #connectivity can help create a better world for people and the planet. Read a blog post by Rajeev Suri: https://nokia.ly/2JKr6IG  #sustainability #climate #CSR", "For a more sustainable world, where people and planet thrive, we are committed to playing our part. Read our new People & Planet Report: https://nokia.ly/2yEecd5  #sustainability #climate #connectivity #CSR", "What's needed to propel us past the current crisis to a brighter, more satisfying and fulfilled, not-so-distant future for us all? Read a new blog post by @MarcusWeldon. https://nokia.ly/39CZwaN  #connectivity #covid19 #innovation @BellLabs", "#COVID19 has changed the demand on networks. Read Dennis Lorenzin's blog about the 3 steps operators should take to mitigate the impact of these changes on networks. https://nokia.ly/2Jz7nLU ", "Emergency protective equipment for public workers are much needed during the #COVID19 crisis. \n \nIn Spain, a few of our researchers helped out @CoronavirusMak3 to 3D-print face shields, which are currently being distributed. Here’s a prototype. #together #TeamNokia", "The world stays connected during this exceptional time. Networks handle the increased traffic well – so far – with help from the cloud. Read our latest insights based on Nokia Deepfield: https://nokia.ly/2X3DED6 ", "5G #Innovation Award by @TraficomFinland recognizes Finnish #5G innovators: @OuluPort #privatewireless smart digitalization project and #LuxTurrim5G ecocystem at our campus in @EspooEsbo for #smartcity services enabled by #IoT and 5G. https://bit.ly/2UAk1R8  #5GMomentum", "This is a tough, tragic time. #Connectivity can help us get through it. Read a blog post by our Rajeev Suri. https://nokia.ly/39B5atY  #COVID19 #coronavirus #TeamNokia #5G #healthcare #4IR #CSR", "Accurate detection of and a timely response to #malware and #phishing related to #COVID19 help keep our devices secure. @KevMcNamee gives advice on how to address these threats: https://nokia.ly/2WWEdhV  #cybersecurity", "Operators face rising traffic & consumer expectations. It is crucial to predict & prevent service degradations earlier & solve issues faster. Our new Nokia AVA #5G Cognitive Operations enables operators deliver an enhanced customer experience. https://nokia.ly/33Zxk0w  #AI #cloud", "Networks are handling traffic well so far – @labovit examines network traffic in the times of #COVID19 using Nokia Deepfield analytics. Read his latest insights from 16–22 March: https://nokia.ly/2y8e5pO  #IP #BigData", "Proud of our #TeamNokia in Italy who are donating masks and raising funds for local hospitals specialized in virology, and are developing smart solutions enabling #Digitalization. #Together", "We hit a milestone in the delivery of enhanced #5G #capacity via a software upgrade on our commercial AirScale solution & @sprint 5G. This will help operators to vastly increase capacity, delivering excellent customer experiences while keeping costs low. https://nokia.ly/2UvZR9P ", "We announce over 3,000 #5G patent declarations to @ETSI_STANDARDS. https://nokia.ly/2vJ159i  We standardize inventions to allow their widespread utilization & adoption, enabling new applications for consumers, enterprises & industrial businesses in #industry40. @BellLabs @3GPPLive", "Just announced: Four new phones are out!  Check out Nokia 1.3, Nokia 8.3 5G, Nokia 5.3 and Nokia 5310​\n#NokiamobileLive", "The world is quickly changing but we stay current and keep the dialogue open. Take a virtual journey through our #NokiaLive webinars and learn to monetize your #5G investments and evolve your network operations and infrastructure from end-to-end. https://nokia.ly/3begpdb ", "We are working with one of the biggest operators in the world @LGUplus to automate its IP transport & core networks, allowing the launch of #5G services faster while providing subscribers higher speed and unprecedented quality, reliability and security. https://nokia.ly/2Uut84H ", "The Bashettihalli wetland, located in an industrial area in Bengaluru rural district received water after more than a decade as a result of community-led rejuvenation facilitated by WWF India with the support of @nokia\n#WorldWaterDay2020", "Hop on a self-driving shuttle bus at our HQ campus in Finland with @tommiuitto - in a snow storm, no less! Find out more about what #5G car connectivity enables here: https://nokia.ly/3a67ev7  #Luxturrim5G #connectedcars @sensible4ltd @EspooEsbo", "With the COVID-19 pandemic, we are facing an unprecedented situation on a global level. Our Deepfield team has pulled data on the early effects of lockdowns on service provider networks. Read all insights from our Craig Labovitz. https://nokia.ly/3bcw6BB  #BigData #IP", "Who created the Internet? Our @MarcusWeldon @BellLabs shared his view and spoke with @HenkkaHypponen about the potential of #5G, #IoT, #AI and more in #MillenniumTalks series. Watch the full video here: https://bit.ly/2J7fIpT  #mtp2020 @millenniumprize #NokiaInnovates", "From our corner of the world, to yours. Watch the Livestream on Youtube at 4:30 pm GMT, 19 March 2020. Be there with us. #NokiamobileLive​\n http://nokiaphon.es/Nokiamobilelive ", "Our innovations enable @DocomoPacificGu to deliver commercial 5G in a remote part of the Pacific. Through single-platform quad-play services, they improve telemedicine, distance learning and provide other commercial #5G services. https://nokia.ly/2WqJfmv  #NokiaInnovates", "When your coworker is waiting for lunch break. #TeamNokia #WorkingFromHome #FeelConnected", "We introduce new #WiFi 6 mesh router and technology #innovations to deliver ultimate gigabit experience in a #5G world https://nokia.ly/2U5j97b  #EasyMesh", "We take the measures to mitigate the coronavirus seriously and therefore have resolved to cancel the Annual General Meeting initially scheduled to be held on April 8. We will convene the AGM at a later stage as soon as it is practically possible. #NokiaAGM https://nokia.ly/2w8UANs ", "We're proud that Chunghwa Telecom selects us as #5G RAN vendor. As one of the pioneering members of Chunghwa Telecom’s Taiwan 5G Alliance, we will jointly promote the digital transformation for public & private sectors to accelerate 5G momentum in Taiwan. https://nokia.ly/3d54YXb ", "Today we announced our latest partnership with China Mobile to deliver an #IoT based #highway landslide alert platform which has already proven successful at incident prevention. Read the PR: https://nokia.ly/2IVRajW  #safety", "Our Rajeev Suri blogs how we are playing our part in the fight against #coronavirus, and support our employees, customers and societies where we operate. We also launch Coronavirus Global Donation Fund to local groups combatting #COVID19. https://nokia.ly/3b7bBpN  #TeamNokia #CSR", "Now operators can accelerate their #5G IoT services with a fully distributed #IoT edge and pay-as-you-go business models. Read our latest announcement and be amazed by the next-generation seamless connectivity we provide. https://nokia.ly/38ZMq7g ", "If you could design the smartphone of the future, what would it be like? Let @NokiaMobile and @beebomco show you what’s #TechPossible:", "Together with Swiss Federal Railways we complete next generation #FRMCS frequency trial for #smartrail 4.0 project https://nokia.ly/2U8nDIJ  @sbbnews", ".@mobileworldlive @SpringhamJustin interviews our @phil_twist: with #5G you move beyond connectivity into a digital service network. It's a full network upgrade across all domains, rearchitectured to move towards #cloud-native architecture. #IoT #security", ".@BellLabs records and #innovations in fiber optics to enable faster and higher capacity #5G networks of the future https://nokia.ly/33eH9rj  #NokiaInnovates", "We enabled @etisalat to set a world-first capacity record for optical networks. Our innovations meet the growing bandwidth demands of enterprise customers and #5G while lowering business costs. https://nokia.ly/2Q9TJCZ  #NokiaInnovates", "Life-critical apps need uptime. How ready is your network to deliver real-time #healthcare? \n\nHere are 10 questions to ask your #CIO: \nhttps://nokia.ly/37Nm8WA ", "The @GdParisExpress has selected @nokiaindustries and @ENGIEsolutions to deploy an industrial-grade #privateLTE network for new automated #metro lines of the #GrandParisExpress metro. Read more: https://nokia.ly/2TMM13T  #GoAllwhere", "Launched today: Nokia Live hub page. Join the #NokiaLive community here and stay tuned for updates: https://nokia.ly/2vhpBOI  #5G #privatewireless #industry40", "It is time to end #healthcare silos once and for all. Our @CindyBergevin says network admins can now deliver adaptive, aware and patient-centric services while prioritizing mission-critical data. #SDWAN #IoT\n\nLearn how with Nokia Healthcare: https://nokia.ly/33QeLu3 ", "We are proud to announce the successful deployment of @IAApress's next-generation #airtraffic control network at its new West Ireland disaster recovery center. Read more: https://nokia.ly/3378BHr  #GoAllwhere #IrishAviation @nokiaindustries", ".@Rakuten_Mobile selects Nokia for optical transport for its first #5G #cloud-native mobile network https://nokia.ly/2TDbUD2 ", "Gain a broad, technical understanding and realize the full potential of End-to-End #5G from a market and #innovation leader. https://www.nokia.com/networks/training/5g/bell-labs/ …\n@BellLabs", ".@DellOroGroup announces that we are now #1 in #IP Edge #Routing worldwide for the first time and we can't thank our customers enough for reaching this epic milestone. Read more in our @manishOttawa's latest blog. https://nokia.ly/32TmZTA ", "Our trainee and thesis worker Nea Klossner blogs how technology got hold of her, and shares her views for a bright future for #GirlsinSTEM. https://nokia.ly/2TPR4iD  #IWD2020, #WomenInTech, #WomenInSTEM, #GenerationEquality #GenderDiversity.", "Happy #IWD2020 to all women and girls out there. Be #GenerationEquality and realize your rights! Check out our #StrongHer events . https://nokia.ly/32S94gy  #WomenInTech #CareerWoman #GenderDiversity", "Our #TeamNokia #StrongHer members aim to inspire all women to unleash their potential and change the way we look at talent, irrespective of gender. https://nokia.ly/32S94gy  #IWD2020 #WomenInTech #CareerWoman #GenerationEquality #GenderDiversity", "On this #IWD2020, we are one of 35 leading European industrial companies that have reported @ert_eu progress on women in their businesses since 2012. \n\nFind out the latest key figures here:\nhttp://bit.ly/2IrfDNK \n#EmbraceDifference #IndustryNeedsWomen", "Apply for the Nokia Bell Labs Prize 2020, which is a competition for researchers around the world with disruptive #innovations that have the potential to form the foundation of the next industrial revolution and manifestly change human productivity. https://nokia.ly/2vJue4g  #5G", "We fight for inclusive working cultures, gender #diversity in tech roles & unbiased leadership. That’s why we’ve joined forces with @VodafoneGroup to help #ChangeTheFace of tech and ensure it represents everyone. Sign up & make your pledge here: http://bit.ly/2TrInMD  #IWD2020", "Introducing the latest in a line of OZO-equipped smartphones from @oppo, the Find X2 series. The OPPO Find X2 and Find X2 Pro, embedded with the latest generation of OZO Audio is the culmination of our long and close partnership. https://nokia.ly/2IrpT8p  #OPPO #OZOAudio #OZO", "This #IWD2020, we present the latest data in our ongoing campaign to promote the career advancement of women in industry. Find the report here: https://ert.eu/voluntarytargets2020 …\n\nThe ERT #EmbraceDifference pledge is supported by +50 CEOs & Chairs of European companies #IndustryNeedsWomen", ".@sprint deploys #5G in some of the largest cities in the U.S. using Nokia innovations to bring blazing fast network speeds to around 20 million people, improving customer experience. https://nokia.ly/2ToMqsT  #NokiaInnovates", "We are thrilled to announce our latest partnership with @CENGNCanada and @NORCAT to install and operate a #privateLTE / 4.9G wireless connectivity network in NORCAT’s Underground Centre. Read the PR: https://nokia.ly/39up1fh  #miningindustry #GoAllwhere", "We have published our \"Nokia in 2019\" annual report.  https://nokia.ly/2vKl1si ", "Happy #WorldEngineeringDay! We are tremendously proud of our brilliant engineers, mathematicians, scientists, and researchers who change the way we live and work. \n\nGot a revolutionary idea? Submit it for the Nokia #BellLabsPrize2020. \n\nLearn more here: http://bit.ly/3cwmpj6 ", "We collaborate with @intel on silicon technology #innovations for 5G New Radio and #cloud infrastructure. This partnership highlights our continued commitment to ensuring our #5G portfolio is underpinned by best-in-class technology. https://nokia.ly/2TnQf1o ", "Our Rajeev Suri shares his thoughts about how #privatewireless is driving the Fourth Industrial Revolution. Read his LinkedIn Pulse  update here: http://bit.ly/38iaG4c  #industry40 #AI", "We have teamed up with Marvell to develop silicon technology to further expand the range of Nokia ReefShark #chipsets available for #5G solutions. @marvellsemi https://nokia.ly/38lQZII ", "Together with @TelenorDanmark and @TeliaDanmark we create the world’s most advanced shared wireless network in #Denmark to test new 5G services including #5G calling https://nokia.ly/2TDjvQK ", ".@Mobily boosts digital economy with our next-generation ICT and #AI solutions https://nokia.ly/39qJWzS  @SaudiVision2030 #SaudiVision2030 #5G", "Happy birthday, Alexander Graham Bell! \n\nBell discovered that sound could be carried by light in 1880. Today, millions of texts, audio and video messages are sent around the world every second, on a single strand of fiber. \n\nFull story of light here ", "Our Annual General Meeting will be held on Wednesday, April 8 at 2:00 p.m. at Messukeskus, Messuaukio 1, Helsinki, Finland. Read more: https://nokia.ly/3arn2Zn  #NokiaAGM", "We expand our fiber access portfolio with a Lightspan MF access node, a Beacon 6 in-home gateway & several @BellLabs #innovations reducing #latency. By combining the strengths of #FTTH & #5G, operators can deliver a gigabit experience to everyone, sooner. https://nokia.ly/39jx8eC ", "We’re excited to introduce features that continue to put #OZO at the forefront of device audio. With the introduction of the all-new Audio Framing and Audio Detect we’re continuing to strengthen our offering to be the leading device audio solution. https://nokia.ly/3cg6oO2 ", "ICYMI a replay of our press conference is now available at http://bit.ly/3akJ6Vr .", "Our @jelukand blogs: Fair reward for technology inventors, to enable the next generation of #innovation in the automotive industry. https://nokia.ly/2I7Zaha  #connectedcars #IoT", "A press conference for media will be held today at 11:00 EET at Nokia’s Executive Experience Center at Karakaari 18, Espoo, and via webcast at http://bit.ly/3akJ6Vr . Members of the media are kindly requested to bring their press credentials. https://nokia.ly/3agY2DZ ", "Pekka Lundmark appointed President and CEO of Nokia; Rajeev Suri to step down after more than a decade as President and CEO of Nokia and Nokia Siemens Networks. @PekkaLundmark is expected to start in his new role on September 1, 2020. https://nokia.ly/2vtnCqs ", "We have agreed with @Singtel to collaborate on developing and trialling #5G #networkslicing capabilities, based on a Network as a Service approach that provides customers with highly customisable services for a variety of 5G use cases and applications. http://bit.ly/39eRyp7 ", "With our best-in-class market share revenue, contract wins and vendor market position, it’s no wonder @Ovum says we have the best competitive position in radio access. Read more in a blog post by @DHSchoolar: https://nokia.ly/2uHHXIq  #5G", "The #LuxTurrim5G ecosystem project, led by Nokia, embeds #5G inside light poles, enabling #smartcity services from #publicsafety and energy efficiency to public transportation and more. #Nokiainnovates for a better quality of living. http://bit.ly/2I0yhM1  #innovation", "We collaborate with Deutsche Telekom to validate world’s first end-to-end #5G data transmission in two network slices on a multi-vendor platform @Telekom_group", "MBiT Index 2020: Total #broadband data traffic in #India increased 44 times over last four years; amongst the highest globally. Find out more on the web https://nokia.ly/2T4dI7Z  and download the report https://nokia.ly/32xViPK  .", "We're pleased to announce our latest #5G industrial-grade private wireless network deployment with @LHTechnik, the leading provider of technical aircraft services, to enable remote engine parts inspection. https://nokia.ly/2Ti5l7r  #GoAllwhere", "Hooray! Together with @Optus, we are delighted to have won a GTI award in the Innovative Mobile Service and Application category for the Optus #5G Fixed Wireless Access Home Broadband solution and service. https://nokia.ly/3a6vyN6  Optus FWA: https://nokia.ly/37YVtVr  #innovation", "Proudly presenting: we launch a new end-to-end slicing network functionality for #4G and #5G New Radio – the first vendor to offer this capability. https://nokia.ly/2HV5cSb  #nokiainnovates #innovation #cloud #IoT", "We are proud to be named again as one of the world’s most ethical companies by @ethisphere. https://nokia.ly/2PijvEz  #WorldsMostEthicalCompanies #TeamNokia #sustainability", "We are creating groundbreaking levels of automation in #network and service lifecycle management within the @Rakuten_Mobile #cloud environment. https://nokia.ly/2HQZ79c  #5G #4G #innovation", "Our innovations enabled @vodafoneNZ to deploy a #5G network – in just six months – providing its customers with the next generation of mobile communications. https://nokia.ly/2FQCDV9  #nokiainnovates", "\"For #5G to succeed, it really needs to be a global solution, adopted by all, with similar standards, even if it happens at different paces in different countries.\" \n\n- David Banjo, Head of 5G E2E Solution Architecture @nokia", "The launch of the new-age operations in digital and #5G era: business-intent driven, automation-native and experience-centric. Get to know our new #cloud-native Assurance and Experience software. https://nokia.ly/2VeJoJ0  #AI", "#5G in 3 figures by Nokia’s CSO Karl Bream at #BCW20: 10 Gbps capacity, 99.9999% reliability, and 1 ms latency. – at Innenhof STATION-Berlin", "Nokia lab by #TeamNokia Chile encourages children to embrace technology in an interactive and creative way while having fun with #5G and #VR activities.  #FeelEngaged #STEMEducation", "Explore our library of high impact 5G use cases and customer stories and discover a world of opportunities opened up by #5G. https://nokia.ly/2T5uTo6 ", "Proud of our team who help provide a bridge to mainstream #education for underprivileged children https://nokia.ly/37MrpfM  #connectingtheunconnected @SamridhdhiTrust", "Just into the station!  New collaboration with @odakyuline_info to carry out trials of our SpaceTime scene analytics in order to identify ways of enhancing #rail crossing #safety. Read PR: https://nokia.ly/39RJE53  #GoAllwhere", "What a year for our Microwave (MW) business! We are proud of what we achieved in 2019. @DellOroGroup just ranked Nokia #2 in MW revenue share in Q419. https://nokia.ly/38VCmx7 ", "Our innovations have improved power grid reliability in Brazil. A #5G ready #privateLTE network makes the #smartgrid in Sao Paulo smarter by providing connectivity and automation and delivering consistent, high quality service. https://nokia.ly/39Mvdz5  #nokiainnovates", "We are pleased to have successfully completed a #5G core standalone (SA) network trial together with KDDI, as it marks a crucial milestone for KDDI’s 5G SA deployment as well as for #Japan’s 5G. https://nokia.ly/2VbaVer ", ".@OoredooQatar to use Nokia #AI-powered customer engagement solution towards monetizing #5G and providing improved digital experiences to its 3 million subscribers. https://nokia.ly/2wrLQBz  #CustomerExperience", "We are expanding our footprint by bringing Elenion’s technology expertise and unique design platform and services on board. https://nokia.ly/2V5q0y0 \n#5G #optical", "ICYMI: in a joint #5G #gamechanger event with @VodafoneGroup our Rajeev Suri discussed how 5G enables #industry40 and how it provides an immense growth potential and a massive opportunity of saving money, increasing productivity, getting greener & making digital happen at scale.", "Thank you @PesicJelena_  for sharing why you find it amazing to work at @nokia @BellLabs #TeamNokia to innovate game changing solutions. #nokiainnovates #WomenInScience #WomenInSTEM", "ICYMI: we have partnered with @airtelindia to offer #privateLTE based #industry40 solution to enterprises, and explore the development of #5G use-cases for the enterprises. #IoT #cloud #AI", "We launch first-of-its-kind #5G certification program to train and certify industry professionals. This vendor agnostic program will help companies to realize the full business potential of end-to-end 5G networks. Read more: https://nokia.ly/2vEv9Ti  @BellLabs #nokiainnovates", "We received the “IT Partner Award of Year 2019” from @Mobily Saudi for our outstanding performance during 2019. Thank you for the trust and recognition in Nokia software solutions: our Mostafa Elgabbas receives the award from Mobily CIO, Mr. Yousef Alsuhaibany.", "#5G paves the future for Connected Vehicles. @5GAA_official #IoT https://nokia.ly/3bFnMLB ", "#Cloud RAN cuts TCO in the #5G era. Industry analyst Phil Marshall gives his views on this and the other benefits of base station virtualization in our blog: http://nokia.ly/2SDBYwj  @AnnaPietil", ". @CNBC interviewed our Rajeev Suri on #5G deal momentum and more.", "This year six Nokia phones received an iF Design Award: \n\n1. Nokia 7.2 \"The Nordic design one\"\n2. Nokia 2720 Flip \"The one that flips\"\n3. Nokia 800 Tough \"The heavy-duty one\"", "Happy #ValentinesDay everyone! In Finland, this day is specially dedicated to friendship.  #FrienshipDay #FeelConnected", "We are delighted to extend our long-standing partnership with French mobile operator @GroupeIliad to roll out #5G networks across France and Italy, making 5G available to 17 million IIiad subscribers across both countries. https://nokia.ly/2UNbsTL ", "Today we’re hosting international journalists at our Headquarters in NJ to showcase our leadership in #5G and our Future X Lab. Learn more about our Future X Lab: https://nokia.ly/37lMVYt ", "Design for Security approach secures software development lifecycle. To ensure the security required by critical 5G use-cases we need to think E2E assurance. We also need unity in EU. @PetteriRantanen @nokia #LE5GForum #5G #cybersecurity", "In a joint #5G #gamechanger event with @VodafoneGroup, our Rajeev Suri discussed how 5G enables #industry40 and how it provides an immense growth potential and a massive opportunity of saving money, increasing productivity, getting greener and making digital happen at scale.", "We're delighted to feature in @millenniumprize #millenniumtalks with our @MarcusWeldon @BellLabs sharing #nokiainnovates and #IoT & #5G industry insights. Watch the teaser with the host @HenkkaHypponen and other partners. #mtp2020 https://nokia.ly/2SFP245 ", "Our #innovations in #AI are enabling #telecom provider POST Luxembourg to improve network performance and increase customer satisfaction. https://nokia.ly/2uvymV7  #nokiainnovates", "5G is bringing added capabilities to first responders that will make us all safer. Learn how we're working with @verizon on 5G for #PublicSafety which will bring faster response times & better situational awareness https://nokia.ly/2OHcrRu ", "We have been selected by Telecom Argentina to help enable new enterprise #IoT services using Nokia Worldwide IoT Network Grid (WING). https://nokia.ly/2vvzDLF ", "We cancel participation at MWC 2020 in Barcelona #MWC20", "ICYMI: @ProximusGroup to deploy private #5G network at Belgium’s @PortofAntwerp using our network equipment. @nokiaindustries", "We provide end-to-end #5G portfolio to @SoftBank to become first in the world to have successfully completed tests demonstrating that non-standalone 5G technology can be used to commercially operate #connectedcars. https://nokia.ly/2UG36x3 ", "Nokia is passionately committing to programs to empower young girls and women to pursue a career in #STEM. #WomenInScience #GirlsinSTEM #STEMEducation #WomenInTech", "Take immersive experiences up a gear! Read our new white paper \"The platform for immersive #5G experiences with edge #cloud and Cloud RAN\". https://nokia.ly/2SdPNlO ", "Building on long-term end-to-end network collaboration, we have been selected by @orange_sk, the leading operator in Slovakia, to prepare its Radio Access Network for #5G, delivering a superior experience for businesses and consumers alike. https://nokia.ly/2ScSlkb ", "Our Karl Bream was delighted to recently receive an award from Francisco Betti @wef & Enno de Boer @McKinsey in celebration of our #5G Oulu Factory Lighthouse. See PR (July 2019) https://nokia.ly/2SnjwaW  Watch #WEF video https://nokia.ly/3bkQ12c  Read WP https://nokia.ly/39hYp0E  #IR4", "We've begun the journey to a new level of mobility. Read more: https://nokia.ly/2OA5Acp  #5G", ". @CNBC interviewed our Rajeev Suri on #5G deal momentum and more.", "See all the materials you need to find out more about our Q4 and full year 2019 results here: https://nokia.ly/3bfTSgT . #5G $NOK", "We announce fourth-quarter and full year 2019 results. Our Q4 2019 results were a strong end to a challenging year with solid free cash generation and continued #5G deal momentum. Read the PR https://nokia.ly/36YzaPr  and see the investor website https://nokia.ly/3bfxzrS . $NOK", "Wind farm operators can now detect turbine faults remotely before they happen. Our #innovation cuts repair costs by up to 97%. https://nokia.ly/38S2JDF  #nokiainnovates #privatewireless #energy", "In an @rcrwirelessnews interview with @seankinneyRCR, Tom Marzetta reflects on his research at @BellLabs that paved the way for commercially-available #massiveMIMO radios. https://nokia.ly/2SeHNQs  #mMIMO #LTE #5G @nyutandon @NYUWireless #innovation", "Working with partners like @Microsoft is always a pleasure: our entry for building the right Telco #AI ecosystem is shortlisted for the #GLOMOAwards at #MWC20! https://nokia.ly/2vRY7PB  #5G #innovation", "What does 2020 hold for #5G? From catalyzing edge-computing, to the move towards a #cloud-native core, there’s a lot to get excited about. The industry’s leading analysts at #NokiaIAR event weigh in on the trends that we can expect in 2020. Watch it here", "Orange Spain, Nokia make standalone #5G data call in Vigo @orange_es @BellLabs via @Telecompaper https://nokia.ly/394QpzL ", "We’re proud to be recognized by @CDP as a Supplier Engagement Leader. By engaging with our suppliers we’re sparking a cascade of #climateaction down our value chain. https://nokia.ly/37VgelS  #CDPSupplyChain #sustainability", "Are you a journalist or industry analyst traveling to #MWC20? We'll kick off MWC 2020 on Sunday 23 February with a media and analyst update hosted by Rajeev Suri at the Crown Plaza Hotel, Barcelona. https://nokia.ly/38ZAK4I  #5G #NokiaIAR", "We are impressed by the courage, efficiency and decisiveness of #TeamNokia China in dealing with the current difficult epidemic. Several actions are in place and in progress to ensure customers’ smooth operations and employees’ health and safety.", "Just in: we launch Nokia Network Operations Master, #cloud-native, vendor-agnostic and highly-automated network operations software for operators to manage their #5G networks. Read more: https://nokia.ly/3b7ONqQ  #MWC20", "We also worked with @nokia to revive the wetlands of Karnataka.\nBashettihalli wetland in Karnataka, India held little to no water. They finally received water for the first time in 2019 after over a decade long dry spell.\r#worldwetlandsday #wetlandsandbiodiversity #naturematters", "#dyk Through our partnership with @nokia – we have managed to revive 30 hectares of Bengaluru’s wetland area!", "Mark your calendars: our Rajeev Suri will give a keynote about new value in the fourth industrial revolution at #MWC20. https://nokia.ly/2uNacFk  #industry40 #5G", "How does #5G network deal with #privacy related threat to mobile core network? Our\n@VarnaiZoltan shares insights: https://nokia.ly/34zEgBH  #DataPrivacyDay", "When it comes to helping those in need, #TeamNokia Chile is always onboard.  #CSR #SocialImpact #FeelEngaged", "Building on our existing market share and long history with Orange, we are thrilled to sign a #5G deal with @Orange_France, one of the largest mobile operators in Europe. https://nokia.ly/2UcfYeg  #5GinAction", "Interesting panel on #5G, quantum computing, digital transformation, diversity and the human bias that affects how we build technology such as #AI with @HarriHolma from Nokia @BellLabs, IBM's @RashikParmar, founder of Inklusiiv @katjatorop, & Reaktor's @spasanen #suomiskenaariot", "Nokia's @KarolMattila gives a glance to #5G and what it means for Europe at the Finland Scenarios workshop hosted by @NWestOffice think tank at @Nokia Executive Experience Center #suomiskenaariot", "We are pleased to share @TeliaCompany's launch of their next-generation #SDWAN services for the enterprise market which will simplify and centralize network control in the #cloud. https://nokia.ly/2tinyce  @SunilSKhandekar", "Watch Nokia's Phil Twist explaining the long journey from CSP to DSP: https://buff.ly/2RC77AF  #GTD19 @nokianetworks #5G #Connectivity #CloudNative #NetworkTranformation", "Watch the @wef live stream replay: \"Shaping the Future of Advanced Manufacturing\". Our Rajeev Suri and other leaders gave a strategic review of the industries, institutions and initiatives driving systemic change. https://nokia.ly/2NVE4pC  #5G #industry40 #WEF20", "We recently demonstrated extraordinary #5G applications to the public in Uberlândia, Brazil with @AlgarTelecom and @PUCPRoficial. Combining #5G with Edge #Cloud Computing will speed up the adoption of high quality #gaming to the general public. https://nokia.ly/2RCfe09 ", "In a world first, Sendai City tested a warning system using drones and a connected network developed by us. These #innovations enable first responders to monitor a tsunami, issue warnings and guide people to safety. https://nokia.ly/31259MY  #nokiainnovates #smartcity", "Our @janerygaard addressed the #EU5GConf highlighting how #5G can increase our productivity, showcasing the digitalization of our #5G Oulu factory. https://nokia.ly/2U8nZRg   She also gave a #5GinAction update for Europe. https://nokia.ly/38P4S2I ", "Join us for this exciting webinar, where we will cover how to simplify #5G networks to bring the full value of 5G services to carriers, enterprises, and consumers. Starts at 10 AM New York / 3 PM London time today. #cloud #automation #openness", "Meet us at #MWC20 and discover how our end-to-end approach to #5G is driving the #innovation for tomorrow and delivering the technology today to make businesses more productive, workplaces safer, economies stronger, and lives enriched. https://nokia.ly/2GweeUX  #TeamNokia", "Only by working together & implementing practical solutions and adding refuse + reduce to reuse, recycle, refurbish can we build a more sustainable #circular planet. Our @piatanska blogs about what we do as a company for #circulareconomy. https://nokia.ly/38QHSAF  #sustainability", "Our Rajeev Suri spoke with @Reuters at Davos about #5G revolution. Watch the video: https://nokia.ly/2TTVx5w  #WEF20", "Our massive MIMO roots run deep. Happy to see it in action!", "With our 200G technology, @PTCLOfficial is now in a position to cost efficiently address the ever-growing demand for capacity and differentiate its services based on quality.", "All over the world in virtually every area of enterprise, our Industrial-grade Private Wireless is powering #Industry40 digital transformation today and the #5G revolution tomorrow. https://nokia.ly/2QXGLsK  #GoAllwhere", "Skiing like a pro to work in Oulu (Finland). Happy Monday everyone! #TeamNokia #HealthierTogether", "#5G is paving the way for connected mobility to really go places.  Read the first blog in our Connected Vehicles series: https://nokia.ly/2GirT1K ", "Watch the @wef live stream replay: \"Shaping the Future of Advanced Manufacturing\". Our Rajeev Suri and other leaders gave a strategic review of the industries, institutions and initiatives driving systemic change. https://nokia.ly/2NVE4pC  #5G #industry40 #WEF20", "Our @bhfrench and Rajeev Suri at Davos, sharing their thoughts about the first green industrial revolution enabled by #5G. Read the blog: https://nokia.ly/36qquRs  #WEF20 #industry40 #climatechange", "For this year’s International #EducationDay, let’s take a moment to celebrate quality education accessible to all. See more on #TeamNokia’s actions: http://nokia.com/sustainability  #Sustainability #CSR", "Great meeting, impressive energy and engagement from the USG. Thank you for insightful discussions! We are delighted to provide the extraordinary in #5G to our customers.", "Our Rajeev Suri spoke with @Reuters at Davos about #5G revolution. Watch the video: https://nokia.ly/2TTVx5w  #WEF20", "What a great day with 100+ hackers of students and experts hard at work targeting #cybersecurity vulnerabilities in our “black box” #NokiaHAckathon at our HQ. Big thanks to everyone and warm congrats to the winners! https://nokia.ly/2Ggr4H1  #5G #cloud #security #cloudsecurity", "Ready, set, hack! It's a lift off for #NokiaHackAthon in good company. Let's find those #cloud #cloudsecurity #5G and other #cybersecurity vulnerabilities. May the best team win! https://nokia.ly/2RkTYvM ", "#WEF20 | @nokia CEO Rajeev Suri discusses the impact of the rollout of 5G wireless technology on the company and the telecom industry.\n\nRead more: http://bit.ly/38rtzC4 ", "It's #NokiaHackathon time again! Stay tuned in our social media channels as the teams set to work on Thursday 23 January to hack for vulnerabilities. Exciting! #cloud #security #cloudsecurity #5G https://nokia.ly/38w9nz0 ", "We partnered with @teliafinland to offer a new 5G solution for its customers. This #innovation enables high speeds & delivers extraordinary performance across a live network. We look forward to enabling more companies to innovate with #5G. https://nokia.ly/30KkBNF  #nokiainnovates", "We are proud to be one of the most valuable and strongest brands once again in 2020 according to @BrandFinance. Well done #TeamNokia, let’s keep moving upwards! https://nokia.ly/30Ryj1y  #BFGlobal500 #WEF20", "Happy to be recognized for our #climate work again by @CDP. Another marker on our journey to 1.5°C.  https://nokia.ly/2nR8YWn  #climateaction #sustainability #WEF20", "Join the live stream starting soon from @wef in @Davos by @businessinsider and @Microsoft. Our Rajeev Suri will join the panel to discuss \"Dawn Of A Decade: What Tech Can Do, What Tech Should Do\" together with @BradSmi and @hblodget. #5G #industry40 #WEF20\nhttps://nokia.ly/2Rec3vq ", "Full house in #Davos #WEF20 #connectivity session kicking off @UNBBCom 10 yr celebration & #DecadeOfAction #Agenda2030 looking @ financing models to connect the other half, and bold big efforts to connect the world’s schools. http://Giga.partners  #LeaveNoOneBehind", "Our Rajeev Suri facilitated a discussion at @UNBBCom Special Session at #WEF20 about how to ensure inclusive meaningful connectivity for a safe digital future from the perspective of the youth. @wef @Davos #ICT4SDG #STEM #connectivity Watch the video: https://nokia.ly/2RuK89m ", "Financing inclusive meaningful #connectivity& #broadband for #sustainable impact- ⁦@UNBBCom⁩ session ⁦@wef⁩ #Davos2020", "Via @business @pohjanka: \"Nokia CEO Sees Tech Spurring ‘Massive’ Global Productivity Gains\" #industry40 #WEF20 Read the article:", "We are proud to be recognized as a leader in advancing gender equality globally and of our people –both women & men– who are helping to make that happen. Our @bhfrench blogs: \"@Bloomberg shows Nokia is breaking the glass ceiling\". https://nokia.ly/38s9MT4  #diversity #BloombergGEI", "As part of our continuing commitment to gender equality, we are proud to announce our inclusion in the @Bloomberg Gender-Equality Index for 2020! https://nokia.ly/30Hf7Ub  #BloombergGEI #InvestedInEquality #DataForGood #GenderEquality #diversity", "While in Finland, it was imperative that we visit Nokia! To make Taipei a Smart City, we need to learn from Finland’s pioneering work in #telecommunications, #information technology & #electronics. @Nokia is truly a symbol of Finnish national pride. Thank you for this experience.", "We had the pleasure of hosting Taipei City Mayor @KP_Taipei Ko Wen-Je to showcase how we can help connect cities with #5G-enabled #smartcity solutions e.g. intelligent lamp posts & integrated operations & analytics platforms. Thank you for the discussions! https://nokia.ly/2RxLd0i ", "The #WEF20 livestream has started, join now: https://www.weforum.org/events/world-economic-forum-annual-meeting-2020/sessions/shaping-the-future-of-advanced-manufacturing … #industry40", "We visited @ArcelikGlobal at their Çayırova Campus in Turkey & experienced “Atölye 4.0” Arçelik’s manufacturing technologies R&D center and washing machine factory. In a fruitful workshop with Arçelik digital & technology teams we evaluated joint #privatewireless #5G use cases.", "The @wef Lighthouse Network brings together 44 of the most advanced factories in the world. Our #5G \"factory of the future\" in Oulu, Finland was selected in July 2019 by @McKinsey and #WEF as an Advanced #industry40 Lighthouse. #WEF20 Watch the video:", "It's time for the first green industrial revolution https://wef.ch/30vY1Z8  @nokia #wef20", "Join #WEF20 livestream: \"Shaping the Future of Advanced Manufacturing\" on Tuesday, 21 January at 9:30 - 10:15 CET. Rajeev Suri & others will give a strategic review of the industries, institutions & initiatives driving systemic change. https://nokia.ly/37aSDNF  #industry40 @wef #5G", "Climate change is a reality, and we are compelled to act. Our Rajeev Suri shares his views ahead of @Davos, where he will address pressing global issues with other top leaders. https://nokia.ly/375TCyB \n#WEF20 @wef #industry40 #5G #climatechange #SDGs", "Never stop amazing, delivering, protecting, growing...  Make your network and business unstoppable with bigger, smarter, safer, automated networking at webscale. https://nokia.ly/2FYhJ6j  #privatewireless #5G @nokiaindustries", "From now to next: Nokia Industrial-grade Private Wireless is powering #Industry40 today — and the #5G revolution tomorrow. https://nokia.ly/3agNJk8 ", "#TeamNokia Wrocław (Poland) brings together the best minds, makers and means to focus on creative work methods which lead to innovations and unique realizations. http://nokia.com/innovation   #FeelConnected #NokiaInnovates #ICT #NokiaGarage", ".@anatel_oficial has authorized @NeoenergiaBR distributor, @OficialElektro ,to pioneer a #privateLTE network in Sao Paulo! We're excited to be a partner in this new initiative which brings the first private LTE broadband network to Brazil. https://nokia.ly/35MbM76 ", "Our innovations enabled @vodafoneNZ to deploy a #5G network – in just six months – providing its customers with the next generation of mobile communications. https://nokia.ly/2FQCDV9  #nokiainnovates", "By 2035, the #5G industry will be worth $13.2 trillion and have created 22.3 million jobs. This report studies the key industrial advances and social impact areas in addition to the drivers of 5G. \n\nRead it here: https://wef.ch/35xB7BE  #technology #innovation", "Our webinar The future network: unlock the value of #5G with cloud-native core will be broadcast 29 January 10:00 New York | 15:00 London. Sign up now: https://nokia.ly/3a77SJ8 ", "We've worked with Sendai City to create a tsunami warning system based on Nokia Drone Networks for disaster alert and rescue. Watch the video to see how the drones will help save lives https://nokia.ly/302TuNv  #SmartCity", "Our Antti Toskala and @HarriHolma @BellLabs with Takehiro Nakamura of @docomo publish a world leading university level book on @3gpp wireless, providing a comprehensive guide to #5G technology, applications and potential for the future. https://nokia.ly/2FN05lV  #innovation", "Attending #NRF2020? Come see @nokianetworks and @VerizonBusiness. We have a fantastic lineup of solutions and applications to help you reimagine the customer experience and power your business operations. #5G", "Download this @wef white paper which analyses 40 use cases to understand how #5G will transform industries and society delivering an estimated USD 13.2 trillion of economic output by 2035. https://nokia.ly/2sLbVdG  #industry40 #wef20 @Davos", "Celebrating momentum with 63 Commercial 5G deals, 18 live networks and over 100 5G agreements. Our #5G momentum is underpinned by continued leadership in cellular technology R&D and standardization. Read more: https://nokia.ly/2FGYA8S  #innovation @tommiuitto", "Our Hans Geerdes shares our strategic megatrends research and why CSPs transformed themselves in response to distruption and change.  https://nokia.ly/2TalQUF \n#5G", "ICYMI: @DB_Bahn has awarded the tender to test and deliver a world-first standalone #5G system for automated rail operation in Hamburg, Germany, to Nokia! https://nokia.ly/2T7bMf8  via @GlobalRailway", "The dynamic team from @VerizonBusiness and @nokianetworks is kicking off @NRFBigShow booth 3237. We are ready to help retail customers deliver omnichannel shopping experience! #5G #NRF2020", "Check out #ThisHappened2019 for the posts you liked the most, and follow us on Instagram for more magical moments in 2020. https://nokia.ly/2ud8b4X  #5G #MWC19 #robotics #diversity #sustainability #climateaction #leadership #innovation #WiFi #smartTV #privatewireless #TeamNokia", "Are you one in a million following us on @LinkedIn? If not, join us for #TeamNokia, #innovation, #5G, #privatewireless and other business and industry insights! https://nokia.ly/3823utr  #socialmedia #LinkedIn", ". @AnalysysMason writes how @sprint and @hatchplay bring mobile #cloud gaming to consumers - with #5G powered by @nokia. Let's play! #5GInAction #Sprint5G", "We continue our exciting evolution driven by device innovation, technology adoption trends and ever-expanding use cases in device audio. Read our blog: https://nokia.ly/35DllVW  #OZO #mobileaudio #spatialaudio", "RT @danielnewmanUV I don't think a lot of people realize how big of a role @nokia  is playing in E2E security, but it is big business for the company. Good in-depth analysis from  @sirronsilicon1 -> Nokia Secures Its Security Messaging https://buff.ly/2FtxwKj  #5G #CyberSecurity", "5 cheers for 5G momentum: we're celebrating 63 commercial #5G deals! Read more: https://nokia.ly/37Psdkp  #innovation", "What do you look for in a #5G partner? More and more operators in leading early adopter markets are looking to us to drive business success. Learn why in this blog from @phil_twist: https://nokia.ly/36zZHmM ", "Our very own @jre_elliott will join @robpegoraro of @YahooFinance and Arvin Singh of @verizon in a #5G meets #HighTechRetail panel today. https://nokia.ly/36zkmav  Not at #CES2020? Read Jason's blog \"Retailers and shoppers rejoice\" https://nokia.ly/2QzAFi7  @HighTechRetail", "We're delighted to continue to contribute to a group of cross-sector Nordic companies collaborating for a sustainable future. https://nokia.ly/2Fwo1db  #sustainability #SDGs @GSMA @AnthonyDArcy1", "Our Karl Bream on Enterprise #IoT Insights: \"2020 will be transformative for every industry & application, boosting productivity, efficiency & safety of operations & enabling new business opportunities.\" #5G #privatewireless @Multefire #CBRS #cloud #IIoT", "Download this @wef white paper which analyses 40 use cases to understand how #5G will transform industries and society delivering an estimated USD 13.2 trillion of economic output by 2035. https://nokia.ly/2sLbVdG  #industry40 #wef20 @Davos", ".@INETInnovation seeks to become the first to provide ultra high-speed technology to oil and gas industry customers in the Permian Basin, the largest and busiest oil field in the USA, powered by @nokia #4G & #5G. via @HoustonChron #privatewireless https://nokia.ly/2SYUHnF ", "What will it take to build an AI-driven telecoms industry? Get your copy to learn about the strategic and business opportunities enabled by #AI: https://nokia.ly/36qdWdO ", "Your favorite tweets of the year in 2019 #5G #sustainability #innovation #AI #IoT #cloud #VR #industry40 #tech4good  “2019 #ThisHappened”", "Brendan O'Reilly, @TelefonicaUK CTO, explains on video how @nokia technology was put to the test in @O2’s real-world, real-time, real-live #5G network and it passes with flying colours. Watch on @TelecomTV:", ".@DocomoPacificGu launched the 1st operational #5G network using @nokia’s end-to-end 5G solution. Ron Brewster, Director of marketing, explains how the use cases that their customers are looking forward to is #security, telemedicine and distance learning. https://nokia.ly/34AHvrk ", "Check out #ThisHappened2019 for the posts you liked the most, and follow us on Instagram for more magical moments in 2020. https://nokia.ly/2ud8b4X  #5G #MWC19 #robotics #diversity #sustainability #climateaction #leadership #innovation #WiFi #smartTV #privatewireless #TeamNokia", "It’s been a pivotal year for #5G, with commercial deployments giving rise to new experiences and possibilities. We look back on the key moments for our customers, and hear from the experts on what to expect in 2020: https://nokia.ly/2Q0VUaK ", "Our Ulrich Dropmann @uldropmann says that we are on course to complete the #5G vision as he recaps the technical details from two important meetings regarding 5G standards – the @ITU #WRC19 in November & the @3GPPLive #3GPP Plenary in December. #innovation https://nokia.ly/2MicX7p ", "Who doesn’t want to work for an inspiring purpose? Check out what #TeamNokia is proudly supporting: https://nokia.ly/2KBDs6R  #FeelEngaged", "Top 2019 #Healthcare Blog Posts!\n\n1. #5G https://nokia.ly/2F6tibr \n2. Private #LTE https://nokia.ly/2YbR4KL \n3. #IT Strategy https://nokia.ly/2VEyXLi \n4. #DigitalTransformation https://nokia.ly/2vSPIYw \n5. #Interoperability https://nokia.ly/2VDKfjK \n6. 5G Use Cases https://nokia.ly/31tg2XZ ", "ICYMI: We collaborate with @BrusselsAirport and @citymesh to build a #5G ready network at the #airport. This will further optimize airport operations, accelerate #digital innovations and facilitate the integration of future #technologies. https://nokia.ly/2rIbhgp  #innovation", "We are truly delighted to be working closer with @VodafoneAU on transforming its network to deliver superior #5G services to its customers. As CTO Kevin Millroy shakes hands with our Jae Won, there are smiles all around. Find out more: https://nokia.ly/2MGEcbV ", "Our climate is in crisis. We need to act: reduce emissions, make more environmentally responsible choices and transition to cleaner energy. Read our CEO Rajeev Suri's blog how we are committing to a cleaner, more connected world. https://nokia.ly/2o0elSJ  #OurOnlyFuture #5G", "Looking back to our 2019 achievements, this year we remain committed to creating technology for a better future. We never stop.  #TeamNokia #FeelEngaged #5G #innovation", "In 2020, Bell Labs celebrates its 95th anniversary. We were founded in 1925 to create world-changing products & solutions.\n\nHave we succeeded? https://nokia.ly/2F6Wv5J \n\nIf so, please ring our *bell* or show us some love! \n\nWishing you a very Happy New Year! \n#happynewyear", "Your favorite tweets of the year in 2019 #5G #sustainability #innovation #AI #IoT #cloud #VR #industry40 #tech4good  “2019 #ThisHappened”", "Happy New Year from #TeamNokia! \n\nJoin the conversation in 2020 in your favorite social media channel. https://nokia.ly/2ScT6dE  #5G #innovation", "Iñaki Berroeta, CEO @VodafoneAU, explains why they partnered with us for their #5G rollout, with a focus on delivering the best possible mobile service for their customers. Read more: https://nokia.ly/2F1qg8f  #4G #Australia", ".@VodafoneAU customers will soon enjoy the benefits of 5G with the announcement today that Vodafone has partnered with us to commence the roll out of its #5G network in the first half of 2020. https://nokia.ly/2SBkeTN  #Australia", "It’s been a pivotal year for #5G, with commercial deployments giving rise to new experiences and possibilities. We look back on the key moments for our customers, and hear from the experts on what to expect in 2020: https://nokia.ly/37nvTd8  #5GinAction #innovation", "Read our top 2019 Blogs!\n1. #Unix50 https://nokia.ly/33meQWI \n2. #Unix https://nokia.ly/2SHQn9f \n3. Internet https://nokia.ly/2Q7Q9bf \n4. #5G Standards https://nokia.ly/34h6OyL \n5. Ashkin https://nokia.ly/2y5yqsg \n6. Nicolelis https://nokia.ly/2XYjybi \n7. 5G Value https://nokia.ly/2SRqecm ", "Thank you for all the social media love this year! Follow us on Instagram to see #ThisHappened2019 for some of the most favorite moments. https://nokia.ly/2YSE9ib  #5G #robotics #diversity #sustainability #climate #leadership #innovation #privatewireless #TeamNokia #Thebestof2019", "The greatest value of #5G is the new applications (much more than better, faster connections) that it will offer to consumers and to enterprises. Our @phil_twist blogs about how to build an extraordinary 5G network & how to shape up for the new use cases. https://nokia.ly/2sNDEd2 ", "Shohei Takigami, CTO @DocomoPacificGu, explains how @nokia has provided advanced technical support to for the launch of the first operational #5G network in the region at every stage of network rollout.", "A game of ping pong anyone? https://nokia.ly/34HVKdI  #VR #5G #latency", "You think Santa could do all that without Private Wireless? \n\nIndustrial-grade Private Wireless: take the virtual experience  https://nokia.ly/2ZdLpW6  #GoAllwhere", "Warm holiday wishes from all of us at Nokia. #teamNokia", "A festive get together for our #NokiaEducation team in Lannion (France) . Wishing everyone happy holidays!", "Together with @nokia and @citymesh #brusselsairport is building a #5G ready network at the airport  This will further optimize our airport’s operations, accelerate #digital innovations and facilitate the integration of future #technologies. >>", "Season’s greetings from #TeamNokia around the globe! ", "One short year for us, one giant leap for 5G. For our customers, 2019 has seen huge strides in #5G technology. We look back at the best bits, as well as set our sights on 2020 – and there’s a lot to get excited about. https://nokia.ly/2PEujNS ", ".@DocomoPacificGu launched the first operational 5G network in the region for enterprise customers using our end-to-end #5G solution. Their executives summarize the advantages of working with Nokia to deliver extraordinary experiences for their customers. https://nokia.ly/2rZ1y5s ", "A heartwarming bunch of season’s greetings from our #TeamNokia in Murray Hill (US). Can you spot Santa’s little helpers? ", "What an extraordinary year for 5G. As we saw over this past year, #5G has arrived — and the future is certainly looking very exciting. Read more: https://nokia.ly/2sZ9Dak ", "We demonstrated first responder technology at #OCR2019 alongside @nokianetworks. The best tech matters when lives are on the line. https://vzbiz.biz/2Mnp4jJ ", "“This will have positive effects on cross-border operation, capacity of rail infrastructure, punctuality of trains and also on customer experience.” Learn more about our #5G autonomous train and rail operations tests with @DB_Presse https://nokia.ly/2EuioeZ  @EIoTinsights", "One short year for us, one giant leap for 5G. For our customers, 2019 has seen huge strides in #5G technology. We look back at the best bits, as well as set our sights on 2020 – and there’s a lot to get excited about. https://nokia.ly/2tnH46D ", ".@DocomoPacificGu launched the 1st operational #5G network in the region for enterprise customers using @nokia’s end-to-end #5G solution. Roderick Boss, CEO, explains how the close relationship with Nokia is a competitive advantage that brings real value. https://nokia.ly/2PxVqtW ", ".@DocomoPacificGu launched the 1st operational #5G network using Nokia’s end-to-end 5G solution. Ron Brewster, Director of marketing, explains how the use cases that their customers are looking forward to is security, telemedicine and distance learning. https://nokia.ly/34AHvrk ", "Our checklist is short, but powerful and comprehensive and provides the end-to-end foundation for making the most of 5G’s possibilities.  https://nokia.ly/36N3e0D \n#5G #5GInAction", "We are getting into the holiday spirit at our HQ when a near-by @espooesbo Karamalmen's skola elementary school's pupils sing carols to #TeamNokia. Kiitos, tack, Thank you! ", ".@docomopacific launched the first operational #5G network in the region for enterprise customers using @nokia’s end-to-end #5G solution. Roderick Boss, CEO, explains how the close relationship with Nokia is a competitive advantage that brings real value. https://nokia.ly/2PxVqtW ", ".@SETARnv has expanded its current partnership with us to provide a full end-to-end #5G network transformation, the first of its kind for Nokia in Latin America. https://nokia.ly/2r4bs5c ", "Watch a handy summary of our #5GinAction LIVE streams discussing and showcasing the latest in #5G during 2019. @nokianetworks @nokiaindustries @BellLabs #TeamNokia #ThisHappened2019  “5G in Action live updates in 2019”", ".@DocomoPacificGu launched the first operational 5G network in the region for enterprise customers using our end-to-end #5G solution. Their executives summarize the advantages of working with Nokia to deliver extraordinary experiences for their customers. https://nokia.ly/2rZ1y5s ", "Our Balazs @Bertenyi, @3GPPLive RAN Chairman, discusses with @guydaniels of @TelecomTV the achievements of the latest 3GPP RAN Plenary for #5G. View the video here, and read his blog post: https://nokia.ly/35qfjIK ", "Hi I'm Rahga, I joined #TeamNokia in 2017 and I am currently based in Espoo, Finland. I work on the latest technology that will drive the next industrial revolution: 5G! Come with me and experience a day in our global headquarters.", "We talked about preparing your business systems for #5G this year. Looking to #2020 it’s time to act to ensure a better customer experience! Read our latest blog on the first wave of 5G consumer services and the need for agile monetization platforms: https://nokia.ly/2LXkKr5 ", "Very proud that we are one of the world’s 25th fastest-growing brands of the past five years, and 2nd best-performing in Europe. Thank you to all Nokia fans!  https://nokia.ly/2ExpO1k  @BrandFinance", "Exciting news in #railway: We're working with @DB_Presse to test automated rail operation using standalone #5G https://nokia.ly/2M6JwF9  via @TelecomTV", "Telia Finland's 5G Programme Director shares his 5G experience with Nokia in a 9 minutes interview - Watch now on: https://buff.ly/34vkE0i  #Networks #Business #Wireless #Mobile #5G #Finland @NokiaNetworks", "Thank you for all the social media love this year! Follow us on Instagram to see #ThisHappened2019 for some of the most favorite moments. https://nokia.ly/2YSE9ib  #5G #robotics #diversity #sustainability #climate #leadership #innovation #privatewireless #TeamNokia #Thebestof2019", "NEW: We've partnered with @TeraGo_Networks to conduct #5G fixed wireless trials in the Greater Toronto & Greater Golden Horseshoe areas in the first quarter of 2020! Read all of the details of this exciting partnership here:", "Ho, ho, ho, Merry Industry 4.0. \n\nExplore the Industrial-grade Private Wireless virtual showcase https://nokia.ly/34eldvd  #GoAllwhere #Industry40", "#ICYMI Canadian startup HaiLa won the 2019 @nokia Open Innovation Challenge! HaiLa offers technologies that can drastically reduce energy consumption for #IoT devices. \n\nNOIC PR: https://nokia.ly/2D15zbx \n#NOIC: https://nokia.ly/2L4GceC \n#industrialautomation #5G #IoT @ngpcapital", "Bell Labs is developing disruptive research for the next phase of human existence. \n\nHome http://nokia.ly/2k2D6e8 \nFuture X http://nokia.ly/2ELmnDs \nResearch http://nokia.ly/2E7b8E8 \nConsulting http://nokia.ly/1UL3odX \nBlog http://nokia.ly/2t0bH1t \nNews http://nokia.ly/2sWTzpm ", "We’re delighted that our #5G fixed wireless access devices were part of providing extraordinary experiences to the public with @starhub. https://nokia.ly/2RWFqTW ", "Tony Baird, @vodafoneNZ CTO, explains the partnership with us spanning well over 20 years, and the successful six-month program to jointly roll out #5G in New Zealand. Watch the video https://nokia.ly/2YFP0eY  and read the PR (of 8 August) https://nokia.ly/38rtAH6 .", "Watch a handy summary of our #5GinAction LIVE streams discussing and showcasing the latest in #5G during 2019. @nokianetworks @nokiaindustries @BellLabs #TeamNokia #ThisHappened2019  “5G in Action live updates in 2019”", "#5G #sustainability #industry40 and more, find out what you favored on @Twitter in  “2019 #ThisHappened” by @nokia", ". @Nokia CIO Ursula Soritsch-Renier talks about the \"truly exciting\" value-creation opportunities offered by #5G in areas like #SmartCities and #IoT\n#IoT #MWC20 #TechNativeTV", "Our @tuuli_ahava & @LauriMTO give a #5GinAction live update how we create innovative solutions that enable customers to positively impact their businesses & deliver extraordinary experiences. Watch the live stream! https://nokia.ly/2Dk5Q9n  #5G #privatewireless #cloud #innovation", "Our Balazs @bertenyi and @3GPPLive RAN Chair, blogged about #5G in Release 17 – strong radio evolution. https://nokia.ly/35qfjIK ", "Our Global Analyst Forum took place at our HQ in November. Watch this video to learn what the participants' impressions were about #5G, #privatewireless, and more. #NokiaIAR", "Our #O25G network is only as strong as the partners, network equipment and infrastructure we work with and we’re happy to have you on board as one of our #5G partners, @Nokia ", "This is what I think of 5G gaming so far... \nhttps://youtu.be/BZ5VpG0d1rU \n#ad #TechPossible @Nokia", "If you want to know how we are building on our 150 year history of #innovation, and what we are doing both today and in the future, read the new blog post by Rajeev Suri and watch this video.  #5G #research https://nokia.ly/2rMCVby ", "The power of #Inclusion helped autistic David excel in the workplace. Watch the whole video here: https://nokia.ly/2Phvv9F  #WhatMakesUs #Autism #WorkingWithAutism", "Learn about the evolution of #5G and how we are a leading force in its standardization. https://nokia.ly/2YEmsTr  #IoT #security #spectrum #industry40 @BellLabs", "5G FDD is here. Nokia dynamic spectrum sharing will make it even better. Especially when combined with 5G core and standalone architecture starting 2020. \n#5g #nokia https://www.nokia.com/blog/nokia-launch-dynamic-spectrum-sharing-solution-2020/ …", "Experience pure design, pure performance with the Nokia 55 Inch Ultra HD (4K) Android TV with Sound by JBL. Available in India, only on @Flipkart: https://www.youtube.com/watch?v=-9eEXw0TUow&feature=youtu.be … #NokiaSmartTV @JBLSoundIn\n\nP.S. Keep an eye on @Flipkart for the next flash sale on 14 December at 12pm IST!", "We sign first Worldwide #IoT Network Grid (WING) deal in Latin America, enabling @TIMBrasil to expand IoT services to its enterprise customers in Brazil https://nokia.ly/38CKi6k ", "Our @fcorredor69 presented how #5G technology and collaboration can help solve environmental challenges with a project “Eagle Eyes”at #COP25Madrid. @teliafinland @VaisalaGroup #climate #sustainability #environment #SDGs https://nokia.ly/2sknNTk ", "Our Mikko Lavanti was honored to recently meet the President of the Republic of Serbia Aleksandar Vučić, and hear that Serbia plans to continue the cooperation with us, especially in the area of landline network & transport optical systems. https://nokia.ly/35iwZ93 ", "Digitalization enables up to 50% faster 5G rollout. Read about digitalizing (the four steps of) #5G deployment in a blog post by our President of Global Services, Sanjay Goel: https://nokia.ly/2qLW3Xh ", "Congratulations to 8 new @BellLabs Fellows whose work has contributed deeply to a broad range of technologies, which have not only made their mark at Nokia, but also on society and humanity at large. #innovation #teamNokia", "#5G #sustainability #industry40 and more, find out what you favored on @Twitter in  “2019 #ThisHappened” by @nokia", ".@KaroliinaLo explains our priorities in #sustainability and how technology together with committed employees plays a key role in building a more sustainable future. https://nokia.ly/35aHFXo  #SDGs", ".@rsiilasmaa welcomes visitors from China-Finland Committee for Innovative Business Cooperation to hear about technology #innovation and how it benefits people, societies and industries. https://nokia.ly/35dlXSx ", "Our @KathrinBuvac is thrilled to announce our latest partnership with @DB_Bahn to deliver the world's first #5G based FRMCS for automated rail operations. https://nokia.ly/2YKl4OX  #GoAllwhere #Industry40 @nokiaindustries", "Check out this blog from @elinaraask on responsible sourcing and respecting Human Rights in the supply chain. #humanrightsday #sustainability https://nokia.ly/36wH1Ux ", "Stephanie Werner appointed Chief Human Resources Officer and a member of the Nokia Group Leadership team as Hans-Jürgen Bill retires https://nokia.ly/2PfJ3SU ", "Tony Baird, @vodafoneNZ CTO, explains the partnership with us spanning well over 20 years, and the successful six-month program to jointly roll out #5G in New Zealand. Watch the video https://nokia.ly/2YFP0eY  and read the PR (of 8 August) https://nokia.ly/38rtAH6 .", "Awesome, #TMobile #5G on low 600MHz frequency band really is the world leading #5G coverage solution. Very proud that #Nokia is part of this.", "Our #TeamNokia in Finland celebrated Espoo Site Day in our Headquarters in the best way ever!  #FeelEngaged", "What benefits can 5G bring to gaming? https://youtu.be/BZ5VpG0d1rU \n#ad #TechPossible @Nokia", "Bananas are delicious, but a banana that can make calls? Now that's a masterpiece! #ArtBasel", "We support the call for an ambitious new industrial strategy to put Europe at the forefront of efforts to tackle the major challenges of the 21st century: #climate change, digitalization and global trade. #industry40 #5G", "As an early-joiner taking action for #OurOnlyFuture, we are proud to see new companies joining the movement.\n\nSee how committing to set 1.5°C-aligned @sciencetargets is the future for business and the : https://nokia.ly/2LJX2hJ  \n\nRead our blog: https://nokia.ly/36m2vTS \n#COP25", "We are proud to continue to work with @telefonica_de to create extraordinary #5G experiences in the O2 network to both private and business customers in Germany.", "We build strategic ecosystem partnership to bring local #5G / #privatewireless #LTE to industrial and government customers in Japan https://nokia.ly/35b8omN  @nokiaindustries #IoT", "Speaking at 5G Game Changers, our Rajeev Suri said \"#5G is the multipurpose technology of the next decade. It will enable, combine or optimize new and existing technology advances, such as high-performance computing, AI and robotics.” https://nokia.ly/2YA32Pn ", "Speaking at 5G Game Changers, our Rajeev Suri said that #5G enabled digitalized networks will bring a new industrial revolution – economies could see productivity jump in the region of 30-35%. https://nokia.ly/35akhZY ", "#5G will connect our world in ways never seen before.  @Nokia's #CIO Ursula Soritsch-Renier reflects on its tremendous potential. \n\n#IIoT #AR #SmartCities #TechNativeTV", ".@Fificp highlights our approach to Human Rights on #humanrightsday. Check this blog post: https://nokia.ly/2RzZlaS ", "Our Global Analyst Forum took place at our HQ in November. Watch this video to learn what the participants' impressions were about #5G, #privatewireless, and more. #NokiaIAR", "Great news: New Zealanders and New Zealand businesses can now join in the global #5G mobile party! Read more: https://nokia.ly/346J0NN ", "Podcast episode 12: Get smart about #ArtificialIntelligence - #AI will be at the heart of everything the telecom industry does. https://www.futurithmic.com/2019/11/21/podcast-episode-12-get-smart-about-artificial-intelligence/ …\n#5G", "Focus on delivering the potential of #5G today: Janne Koistinen, @teliafinland Director of 5G programmes, professes himself ‘very happy’ with Nokia. Thank you so much for the kind words! \n\nWatch the full interview: https://nokia.ly/2DYxeKz ", "What could #5G mean for gaming? Watch Dennis, also known as @ForceStrategy, explore what is #TechPossible:", "Congratulations to the 2019 Bell Labs Prize winners! \n\n1. Tianshi Wang & Jaijeet Roychowdhury @UCBerkeley ($100K)\n2. Sheng Xu @UCSanDiego ($50K)\n3. Maximilian Arnold, Sebastian Dörner, Sebastian Cammerer & Stephan ten Brink @Uni_Stuttgart ($25K)\n\nhttps://nokia.ly/2FE96Nk ", "Proud to be working on 5G with Verizon #Verizon #Nokia5G", "We’re in Cairo for the launch of our newest device! Tune in for the livestream here: http://Nokiaphon.es/NokiamobileLive \n3 hours to go!​\n\n#NokiamobileLive", "Launching for the first time ever, the Nokia 55 Inch Ultra HD (4K) Android TV with Sound by JBL. Available in India from 10 Dec onwards, only on @Flipkart. Check it out now.\n@JBLSoundIn #NokiaSmartTV https://www.flipkart.com/launching-nokia-55-ultra-hd-4k-smart-android-tv-store …", "We're collaborating with @teliafinland to fire up a new innovation hub offering blistering #5G speeds to spark creativity. Read more: https://nokia.ly/2YjOjYX ", "Ready for takeoff! Nokia’s FastMile #5G Gateway powers @vodafoneNZ's 5 minute 5G trial for passengers at Wellington airport. Read more: https://nokia.ly/34NIrcB ", "Our @Volker_Ziegler playing virtual ping pong over #5G with @regio_tv_stgt #InnoDays19 @BellLabs @nokianetworks @nokiaindustries", "A look back on the plan for #5G and business development we laid out at our recent #NokiaIAR event. Have a read!", "Thank you for the kind words! #5G", "Nokia starring in the velvet blue sky in the Southern Branch of the National Palace Museum in Chia Yi, Taiwan. The presentation was accomplished with 150 drones, and was enabled by Chunghwa Telecom mobile network, supplied by Nokia. https://nokia.ly/33SAfqw ", "Sari Baldauf proposed to be the new Nokia Board Chair, following rigorous succession planning, subject to AGM2020. On behalf of the entire Nokia team: Thank you Risto for excellent partnership in the past 12 years! https://nokia.ly/2P80p31 ", "We have been selected by @fingrid_oyj, Finland’s national transmission system operator, to transform their nationwide #smartgrid for better support of renewable energy. https://nokia.ly/2LhwLaw  #GoAllwhere #NowToNext", "Today we are celebrating the beauty of #Inclusion! Check out Marion’s inspirational story. Watch the whole video here: https://nokia.ly/2OLkfSJ . #WhatMakesUs #IDPD", "An interesting read on how a small port like @OuluPort can work as a test bed for #5G-enabled smart cities. https://nokia.ly/2Rf9fhW ", "If you want to know how we are building on our 150 year history of #innovation, and what we are doing both today and in the future, read the new blog post by Rajeev Suri and watch this video.  #5G #research https://nokia.ly/2rMCVby ", "Our @tuuli_ahava & @LauriMTO give a #5GinAction live update how we create innovative solutions that enable customers to positively impact their businesses and deliver extraordinary experiences. Watch the live stream! https://nokia.ly/2OtH2lY  #5G #cloud #innovation #industry40", "\"#5G #security -  a new approach to building digital trust,\" says Niklas Lindroos from @nokia \n#5GCyberHack #5G #digitalsociety #cybersecurity #mobilenetworks #network", "With #5G ’s end-to-end transformation of networks, millions of nodes need protecting. Learn how automation is simplifying the process: https://nokia.ly/2pYISBJ \n#security", "Nokia’s Oulu Factory Named #5G Factory of the Future by WEF https://buff.ly/2OtIQvf  @engineeringcom\n\nThe factory leverages the use of its own 49G/LTE wireless networks to produce 1,000 4G and 5G base stations per day.", "Nokia Foundation proudly recognizes the exceptional value of #ElementsofAI in inviting all people of the planet to join the main stream technology revolution. Congrats to @teemu_roos @UnivHelsinkiCS and Hanna Hagström  \n @ReaktorNow. Join us and retweet! https://nokia.ly/37PhPdm ", "Read how @vodafoneNZ predicts 10% power savings with network upgrade program #sustainablity #5G #energy", "We develop Tarantool-based automation module for our Integrated Operations Center. Tarantool is an open-source solution designed by @mailru for high-speed request processing used to automate #IIoT innovations in Russia. #cloud #5G https://nokia.ly/33vLbtE ", "ICYMI: @MarcusWeldon discusses how #5G networks have the potential to create more than $1 trillion in new value by 2028 by enabling the modernization of industries and industrial Internet of Things. @BellLabs #innovation #industry40 #IIoT", "In partnership with us, @SNCF will create a #5G Lab that explores rail and non-rail use cases and prepares the transition of #GSMR towards Future #Railway Mobile Communication System. https://nokia.ly/2qS1i7L ", "Congratulations to @SparkNZ on ‘switching on’ #5G home broadband services in 5 additional areas of South Island - this builds upon the 5G service Spark switched on in Alexandra in September. We look forward to working with Spark to enable further locations in the coming year.", "With @ZainKSA we are part of the largest #5G launch in the Middle East and Africa region, which is focused on delivering broad socio-economic benefits and contributes to #SaudiVision2030. @Zain @nokianetworks @BellLabs Read more: https://nokia.ly/33wkdm0 ", "See every snare, kick, and solo. In our test with @Nokia & @tencentcloud, Multi-access Edge Computing enabled 18K fans to stream HD video with 0.5 seconds latency.", "5G is here, ready to meet the demands of connected consumers and companies. New services, revolutionary applications and endless opportunities to monetize. Learn more about the extraordinary potential of #5G. https://nokia.ly/2ONtfWo  #Extraordinary5G #Nokia5G", ".@KathrinBuvac at #InnoDays19: \"There are key factors driving #Industry40, particularly more spectrum in licensed & unlicensed bands. Germany is a leader as one of the first countries to allocate dedicated #spectrum for industries in Band 43.\" https://nokia.ly/2OGdEYk  #NowToNext", "Brendan O'Reilly @O2 talks about their #5G rollout & the importance of partnerships to @TelecomTV. Read \"Nokia technology put to the test in O2's real-world, real-time, real live 5G network and passes with flying colours​\" + watch the video. https://nokia.ly/2XRjslZ  @TelefonicaUK", "New services, revolutionary applications and endless opportunities to monetize; that’s the extraordinary potential of #5G. Learn how to put 5G to work. https://nokia.ly/2OctPh8 \n#Extraordinary5G #Nokia5G", "What evolution of the “device” do you think will drive #5G adoption:", "Learn more about O2's 5G launch in the full interview feat. Brendan O'Reilly, CTO @O2 https://buff.ly/2KUeZtL  #5G #Network @NokiaNetworks #Telecoms #Mobile #Data #Intelligence #Business", "Wondering how a #5G cell site is constructed? ⁦@juhasaarinen⁩ came along to a site build last week to find out ⁦@nzherald⁩ #tech ⁦@nokia⁩", "Our @nokia country head Wolfgang Hackenberg speaking about #5G as disruptive technology at the #InnoDays19 @nokianetworks @BellLabs @nokiaindustries", "#multistakeholder #collaboration is a key theme in the conference - @MikkonenOuti and @AnthonyDArcy1 explain the #sharedvalue cooperation between @unicef_finland and @nokia. Cooperation with businesses is built in the new @UNICEF education strategy https://www.unicef.org/reports/UNICEF-education-strategy-2019-2030 …", "From #NowToNext: industrial-grade #privatewireless is powering industry 4.0 today — and the #5G revolution tomorrow. Join our vision and follow @nokiaindustries for updates! https://nokia.ly/2KRhHQA  #GoAllWhere #industry40", "Great discussion with @CarienPret on how #5G will be a big asset for developing nations. At @Nokia, the only truly global E2E 5G vendor, we are ready to help our customers enable human and economic development in all parts of the world. #nokia5g \nThanks for visiting us in Espoo!", "Today, 25th of November, students from universities all over Europe visited the Nokia Bell Labs Students' Day during Nokia #InnoDays19 in Stuttgart, Germany! #5G #IoT #AI", "The \"4P\" of #5G for Philippe Poggianti @PhilPogg @nokia : #Productivity #Proximity #Power of #E2E and #Partnerships & #ecosystems critical for #success!At the #5G #Conference organised by #g9plus Institute @G9Plus hosted by @SopraSteria in Paris.\n\n#partnership #ecosystem", "Our Hans-Jürgen Bill participated in a panel about #education and skills at the Internet Governance Forum today in Berlin, and emphasized the importance of lifelong learning. https://nokia.ly/33eiotL  #digitalization #IGF2019", "Our @tuuli_ahava & @LauriMTO give a #5GinAction live update how we create innovative solutions that enable customers to positively impact their businesses & deliver extraordinary experiences. Watch the live stream! https://nokia.ly/2Dk5Q9n  #5G #privatewireless #cloud #innovation", "Watch this handy recap video of Nokia Open #Innovation Challenge Award celebrations. Warm congrats to all the bright minds who participated, and HaiLa for winning the challenge. https://nokia.ly/2ODVAxY  #industrialautomation #IoT #5G #NOIC @BellLabs @ngpcapital", "A throwback to #Futurecom2019. #TeamNokia illustrates how we are supporting operators in their journey to #5G as well as the enterprises' digitalization journey: from business value-creation to end-to-end network preparation in all technology domains. https://nokia.ly/2KJyNji ", "Learning about #cybersecurity, playing with green screens and taking a walk through the future with @nokia … that's what we call an amazing g4g morning at our #g4gAntwerp today ! #girlsinSTEM #AnythingisPossible #g4gNokia #robotics #womeninSTEM #girlsintech #womenintech", "Drones to the rescue? Watch @Mrwhosetheboss explore how Nokia Drone Networks are helping first responders! #TechPossible #5G", "Brendan O'Reilly, @TelefonicaUK CTO, explains on video how @nokia technology was put to the test in @O2’s real-world, real-time, real-live #5G network and it passes with flying colours. Watch on @TelecomTV:", "Join us for a summary with the bright minded participants to @nokia #Innovation Challenge award celebration. @ngpcapital #industrialautomation #5G #IoT  “Nokia Open Innovation Challenge”", "Our CIO Ursula Soritsch-Renier delivers a keynote at #DF19: \"#5G will bring tremendous opportunities to interact with our customers in new ways and to provide superior customer experience.\" https://nokia.ly/37r5wUf ", "We’re at #Slush19 with @teliafinland! Meet us at booth 6C.8 to experience face payment over a live #5G network and see our 5G Fast Mile indoor gateway in action. We'll also showcase joint 5G use cases. https://nokia.ly/35jx38e  #AR", "Why Nokia 5G is an asset for developing nations", "Ready to take a walk through the future with us and @nokia today, in Antwerp?That's what these 100 girls are doing today during one of our special #STEM workshop! And in addition, we sprinkled some #virtualreality, #robotics, #coding & fun with #statistics! #g4gAntwerp #g4gNokia", "Congratulations to HaiLa for winning the 2019 Nokia Open Innovation Challenge! The Canadian startup company offers technologies that can drastically reduce energy consumption for #IoT devices. Read the PR https://nokia.ly/2D15zbx  #industrialautomation #5G @ngpcapital @BellLabs", "Join us for a summary of impressions from the Home of Radio and #5G. #industry40  “Nokia Global Analyst Forum in Oulu, Finland 21 November 2019 #NokiaIAR”", "Nokia *is* the leading global telecom networking vendor. The overall portfolio is impressive in many dimensions. It controls its own development and has an unrivaled end-to-end story", "We make tomorrow today. #NOIC is truly about evolution and revolution. Proud of all the bright minded participants to Nokia Innovation Challenge. @BellLabs @ngpcapital #innovation #industrialautomation #IoT https://nokia.ly/336keww ", "An insightful #NOIC panel about enabling creativity & unleashing the energy & motivation of people for meaningful revenue. We’re aiming at increasing productivity for humanity with #AI systems helping us, measured and monitored way in a healthy way. https://nokia.ly/336keww  #IoT", "In #NOIC panel, Katrin Bacic represents @WayraGermany, open #innovation hub of @Telefonica uniting entrepreneurs, startups, investors & partners to drive innovative business models and opportunities. #WeAreWayra #WeScaleStartups https://nokia.ly/336keww  @nokia @ngpcapital", "What is the role of #NOIC in creating the future of humanity? Our @MarcusWeldon takes the stage. https://nokia.ly/336keww  #industrialautomation #innovation #industry40 @ngpcapital", "And we have a lift off! The room is packed with curiosity and #innovation. Our @jeanlucbeylat and @tuuli_ahava welcome #NOIC participants and guests to discuss #startups ecosystem and #industryautomation. https://nokia.ly/336keww  @ngpcapital", "Welcome to the opening tunes of @nokia Open #Innovation Challenge award ceremony, where we’ll hear from the #startup company finalists, and announce the winners today. https://nokia.ly/336keww  @ngpcapital #IndustrialAutomation #IoT #NOIC", "We’re on top of the world! Finland may be grey and cold in November, but we hope our #NokiaIAR visitors have enjoyed the bright #innovation shining through, and the smiles and sisu of #teamNokia. Thanks for coming, let’s keep up the conversations! https://nokia.ly/2raRN3i  #5G", "This is awesome! We are very proud of our one-of-a-kind 5G #VR testing environment, which is is used for verification, troubleshooting and optimization, making it faster and more efficient to deploy #5G. https://nokia.ly/349A7DL  #innovation #NokiaIAR #digitaltwin", "Exciting! @SankariErja takes #NokiaIAR on a #5G factory of the future tour in Oulu. Leveraging Nokia technologies to digitalize our own facility is a testament to our ability to digitally transform our customers' manufacturing facilities for #industry40. https://nokia.ly/336My1V ", "Industrial mobile communication, safety control with customer assistant, production quality control, facial recognition payment - the opportunities of #5G are abound illustrates @Janne_Koistinen of @teliafinland at #NokiaIAR https://nokia.ly/2O7FMod  #Telia5G #Nokia5G", "We are delighted to welcome on stage Marko Mykkänen, CEO @OuluPort, to discuss the #digitalization of the Port of Oulu at #NokiaIAR. https://nokia.ly/2Df3dpH  #privatewireless #5G #industry40", ".@Janne_Koistinen of @teliafinland takes the stage at #NokiaIAR to talk mobile evolution, fixed wireless access and industrial digitalization use cases. https://nokia.ly/2rX6asi  #5G #Telia5G #Nokia5G", "At #NokiaIAR, Marko Mykkänen @OuluPort CEO, explains the role of  its highly reliable and business-critical #privatewireless #connectivity platform. Furthermore, he discusses how #5G will create new types of services, service providers & business models. https://nokia.ly/333Rt3t ", "We are delighted to welcome on stage Marko Mykkänen, CEO @OuluPort, to discuss the #digitalization of the Port of Oulu at #NokiaIAR. https://nokia.ly/2Df3dpH  #privatewireless #5G #industry40", ".@SankariErja presents OTAVA lab. It has a unique wall where #5G beamforming is validated with unforeseen speed and quality. Virtualized field tests allow running use cases with real equipment in controlled environment. Read more: https://nokia.ly/2qwKfYJ  #VR #innovation #NokiaIAR", "Our @SankariErja welcomes #NokiaIAR visitors and proudly presents our end-to-end capabilities from radio research to global delivery in Oulu. Our #5G \"factory of the future\" was selected by @wef as an Advanced #industry40 Lighthouse. #4IR #innovation https://nokia.ly/2OuJCac ", "Good morning from Oulu! Besides snow banks, #NokiaIAR visitors will experience the home of radio today. Not there? See this video: https://nokia.ly/337kafS  #5G #industry40 #innovation", "From #NowToNext: Industrial-grade #PrivateWireless is powering Industry 4.0 today — and the #5G revolution tomorrow. Join our vision! https://nokia.ly/336YYXq ", "We bridge the education gap from remedial to mainstream in India with Samridhdh Trust. Education – the right of every child. https://nokia.ly/2O6mobt  #WorldChildrensDay #uncrc #childsrights #UNChildrensDay #SDGs #CRC30", "Day 2 highlights of #NokiaIAR #5G #GoAllwhere #innovation @nokianetworks @nokiaindustries @belllabs  “Nokia Global Analyst Forum”", "Listen to our @HarriHolma explain why good #5G depends on great #LTE network performance and why @nokia leads the way. https://nokia.ly/2r6V5Vp  #NokiaIAR @BellLabs", "It’s a wrap for #NokiaIAR here in Espoo. Thank you for your interest and insightful industry conversations, it was truly a pleasure to have you. Safe travels everyone! https://nokia.ly/331rOIH  #5G #GoAllwhere #innovation @cyberdinne @nokianetworks @nokiaindustries @BellLabs", "\"We have 5 value drivers that create real, long-term value for our shareholders and for our customers,\" our @bhfrench crystallizes the take away points at #NokiaIAR. https://nokia.ly/35nFmQD ", ".@bhfrench summarizes our strategic approach to diversify to enterprise https://nokia.ly/2qyF4HA  and software https://nokia.ly/2CZfIoS  at #NokiaIAR. @nokiaindustries @nokianetworks #GoAllwhere #NowToNext #5G", "Our Sandy Motley explains how with our extensive portfolio of fixed network services and solutions spanning copper, cable, fiber and wireless technologies, customers can bring ultra-broadband services to more people more quickly. https://nokia.ly/2qyxyMS  #5G #NokiaIAR", "#teamNokia presents with passion & great insights customer benefits at #NokiaIAR. In action @MPoikela with #5G end-to-end service orchestration, @AnnaPietil with #cloud RAN, and @tuuli_ahava with high accuracy indoor positioning. @NokiaCareers #innovation https://nokia.ly/2O4JAqo ", "\"We have created a Digital Architecture which allows us to transform our Service Delivery and digitalize CSP’s assets,\" explains our Sanjay Goel at #NokiaIAR. https://nokia.ly/3446aoP  #5G #digitalization", "Sanjay Goel describes in depth our digital services for the #5G era, and our customer commitment. https://nokia.ly/2CYULdN  #NokiaIAR", "At #NokiaIAR, our Justain Bracken joins a panel discussion to illustrate how we are driving operational productivity and efficiency across the company. https://nokia.ly/2QzQoxZ ", "Joerg Erlemeier shares his thoughts about our operational efficiency as a competitive advantage at #NokiaIAR. https://nokia.ly/2OsiI2C ", "We are proud to have @sgegenheimer of @Zain to share his insights at #NokiaIAR: “@ZainKSA #5G commercial launch has been the largest in MEA with @nokia deploying over 1,000 sites in 3 months, a testament to the long-term partnership between our companies.” https://nokia.ly/2Qx204N ", "Our Steve Vogelsang:  \"Like #LTE a decade ago, #5G transport renovations happen before radios. Big architectural decisions made today must enable an expansive roadmap of #5G capabilities tomorrow.\" #NokiaIAR https://nokia.ly/2KzMqBy ", "Steve Vogelsang explains how #optical transport technologies provide network capacity, efficiency, and flexibility to our customers to support services that can be deployed and reconfigured on demand. #NokiaIAR https://nokia.ly/37kvwAF  #5G", "Bhaskar Gorti provides an update on how we are strengthening our #software business at #NokiaIAR.  https://nokia.ly/2O1eZtR  #5G #industry40 #innovation", "Speaking at #NokiaIAR, our Bhaskar Gorti emphasizes: “Our customers require more flexible deployment models, so we’ll support them on any #cloud - private, public, hybrid - or some combination.” #software #5G https://nokia.ly/2OuiqYX ", "Good morning from our HQ in Finland! Another day of insightful industry discussions await. Follow Global Analyst Forum in social media with #NokiaIAR. https://nokia.ly/2OwWEUF  #5G #GoAllwhere #NowtoNext #innovation @nokianetworks @nokiaindustries @BellLabs", "We help make digital learning accessible for the marginalized in Kenya. Education – the right of every child. @UNICEF\nhttps://nokia.ly/2Qyzpfe  #WorldChildrensDay #UNCRC #childsrights #sustainability #UNChildrensDay #SDGs", "Day 1 #NokiaIAR 18 November 2019 @nokianetworks @nokiaindustries @BellLabs  “Nokia Global Analyst Forum”", "Welcome to the #5G Future X Lab with @LauriMTO and @perttilukander. Not at #NokiaIAR? Check out https://nokia.ly/37iiXG0  and read the PR https://nokia.ly/2KEuiXo . #innovation", "Our CIO Ursula Soritsch-Renier will deliver her customer success keynote at Dreamforce 2019. Join us at #DF19 to discover how to do the most for your customers! https://nokia.ly/2Ckca0g ", "What types of things would you like to see #5G technology address the most? \n@nokianetworks @nokiaindustries @BellLabs #NokiaIAR", "“There is a real opportunity for Europe to play a leading role in #5G and associated technologies, like #IoT – and collaborations like ours with @nokia will help us make the most of the potential,” says Johan Wibergh, CTO @VodafoneGroup at #NokiaIAR. https://nokia.ly/35mfVip ", "Busy, busy, busy at #NokiaIAR event. Our mobile #robot runs reliably over pervasive secure #connectivity covering indoor and outdoor. Come by and check it out - let’s #GoAllwhere! https://nokia.ly/2KxjFp6  #NowToNext", "Johan Wibergh, CTO @VodafoneGroup at our #NokiaIAR event: “Nokia is an important partner and we’re working closely together to deliver high quality #5G networks across Europe.” #NokiaIAR https://nokia.ly/2r5MwtN  @nokianetworks", ".@KathrinBuvac: We help customers reap the benefits of #Industry40 with hybrid #cloud & private wireless networks. Enterprise customers who invest today will gain a clear competitive advantage over those who choose to wait. https://nokia.ly/2OuDRZS  #NokiaIAR #GoAllwhere #NowToNext", "#teamNokia proudly showcasing our global expertise and leadership across all #5G network elements at #NokiaIAR. https://nokia.ly/2KClql3  #IoT #smallcells", "Our @KathrinBuvac all pumped about the enterprise opportunity and momentum at #NokiaIAR at the launch of #NowToNext. https://nokia.ly/2CVzHF5  #GoAllwhere #NokiaIAR @nokiaindustries", "“We’re very proud that Sprint and Nokia have together deployed mobile #5G in some of the largest cities in the U.S. - NYC, LA, DC and Phoenix,” said Dr. Ron Marquardt, VP of Network Strategy, @sprint at our #NokiaIAR event. https://youtu.be/Hqiz0EwP6W8  @sprintnews", "“5G will bring a huge uplift in demand for data and high throughput. When you give customers a more capable device, and more network capacity, they will use it,” said Dr. Ron Marquardt of @sprint in #NokiaIAR panel. https://nokia.ly/2pvOS4J  #NokiaIAR @rcorker @phil_twist", "In the USA, we are enabling #5G ultra broadband deployments with our mmWave and cmWave portfolio, achieving great download speeds and enabling new consumer services like #cloud #gaming, says @tommiuitto at #NokiaIAR event. https://nokia.ly/331ktJp ", "At #NokiaIAR event, @tommiuitto discusses our Airscale Radio Access portfolio, which offers a modular approach to building networks that deliver the extreme capacity, massive connectivity and ultra-low #latency required for #5G services. #cloud https://nokia.ly/2pvqLTL ", "Speaking at #NokiaIAR, our @MarcusWeldon emphasizes the demand for integrated, automated end-to-end solutions. #5G #innovation #networkslicing #NokiaIAR https://nokia.ly/2rXHkIZ ", "Our Rajeev Suri shares the #5G momentum at #NokiaIAR. \n- Powerful end-to-end 5G networks.\n- Simplified and automated 5G operations.\n- Amazing 5G customer experiences.\nhttps://nokia.ly/32YnDh4 ", "Rajeev Suri reiterated our five compelling value drivers at #NokiaIAR: \n Our end-to-end portfolio\n Product leadership\n Successful diversification\n Sustainable patent licensing\n Ongoing structural cost reductions\n\nhttps://nokia.ly/2Xw3Nsq  #5G #GoAllwhere", "Our @bhfrench explains how we are committed to a cleaner, more connected world. https://nokia.ly/32YuZ45  #NokiaIAR #5G #GoAllwhere #sustainability #SDGs #climate", "The room is packed, we are ready to rock. Our @bhfrench opens the global analyst forum #NokiaIAR. https://nokia.ly/2CSIFmF  #5G #GoAllwhere #innovation @nokianetworks @nokiaindustries @BellLabs", "Bringing #Industry40 to realization. Proud to announce that we have deployed private wireless #networks for more than 120 customers. Read more. https://nokia.ly/2XtExDa  #NowToNext #NokiaIAR @KathrinBuvac", "Starts soon! Drumroll for Nokia Global Industry Analyst Forum. Follow #NokiaIAR for event updates and participants' impressions. https://nokia.ly/2Ohw3dO  #5G #GoAllwhere #innovation", "Proud: @SparkNZ has selected us for its roster of #5G suppliers. Our 5G technology will be deployed across New Zealand as part of Spark’s 5G network, delivering faster speeds, enhanced response times and more bandwidth to Spark’s customers. https://nokia.ly/2Xsk55j  @SparkNZNews", "Working in partnership with DOCOMO PACIFIC, we are powering connectivity in Guam with the first commercial #5G service in the Marianas. This marks our 49th 5G commercial contract. https://nokia.ly/37gv6v6  @DocomoPacificGu", "We transform lives with @UNICEF in Indonesia. Healthcare – the right of every child. Read more: https://nokia.ly/2KsI9Qr \n#mhealth #UNCRC #childsrights #sustainability #SDGs #CRC30 #WorldChildrensDay #UNChildrensDay", "We’re thrilled to announce that the Nokia 7.2 has been selected as a CES 2020 Innovation Awards honoree for its innovative features, aesthetic design, and engineering qualities. A real honor!", "We are proud to have supported 5 years of early education in Myanmar. Education - the right of every child. Read more: https://nokia.ly/2prufXo  @SavetheChildren #WorldChildrensDay #SDGs #CRC30", "How will you use 5G?\n \n#NokiaIAR #5G", "Today we have announced that our Common #Software Foundation platform now supports Amazon Web Services @awscloud. The result offers CSPs additional deployment choice and faster time to service when rolling out new #5G or digital services. https://nokia.ly/2CUYyZz  #cloud", "Chorus’ Hyperfibre set to redefine ‘fast’ for #broadband in New Zealand https://nokia.ly/2Qsy0qB  XGS-PON", "We look forward to welcoming the industry analyst community at our global industry analyst forum to our HQ in Finland where we'll discuss how we deliver the extraordinary in #5G. Safe travels everyone and bundle up warmly! https://nokia.ly/2CT00f3  #NokiaIAR #innovation #GoAllwhere", "Just in! Nokia and @HitachiGlobal Kokusai Electric collaborate to prepare for reliable #privatewireless digitalization services in Japan as local #5G spectrum becomes available. Read the PR: https://nokia.ly/32UdgdZ  #GoAllwhere", "With @HitachiGlobal Kokusai Electric we bring local #5G and #privateLTE networks to Japanese enterprises. Read more: https://nokia.ly/33XvMUe  #cloud #AI #machinelearning #IoT #drones #VR", "On Thursday 21 November, we will be naming the winners of our Nokia Open Innovation Challenge 2019 as chosen by an all-star panel of judges at our HQ in Espoo, Finland. Learn more: https://nokia.ly/2L4GceC  @BellLabs @ngpcapital #innovation #IndustrialAutomation", "From its @NapervilleIL office, @nokia uses #Fortnite to show off 5G capabilities", "Congratulations to Arthur Ashkin, 2018 @NobelPrize Laureate for #Physics, awarded a Science & Technology Medal at the @RDCouncilNJ's Edison Patent Awards, #2019Eddys on Thursday. https://nokia.ly/34OFSGS \n\n1. Arthur Ashkin and his wife with #NJ @GovMurphy.\n2. Accepting his award.", "Congratulations to our Keith Chow of @BellLabs, #innovation galore! #teamNokia", "Congratulations @JakobHoydis,  you make us proud! #innovation @BellLabs #teamNokia", "ICYMI: With @sprint we launched #5G in some of the largest and densest markets of USA including New York and Los Angeles. The launch included a 5G Immersive Experience and 5G Gaming Contest over Sprint's commercial 5G network. Game on!", "An open network shouldn’t mean your business is open to more risks. That’s why our #5G network protects every layer of the telco stack. It’s end-to-end #security you can trust. https://nokia.ly/2reMu2U \n#5Gsecurity #Nokia5G", "Our Balazs @Bertenyi, Chairman of @3GPP RAN, recognizes individuals for their contributions on #5G Standards and urges more cooperation.\n\nBlog https://nokia.ly/34h6OyL \n#3GPPLive https://www.3gpp.org \n5G Standards https://nokia.ly/2pT6s2o \n5G Patents https://nokia.ly/2Jsb6vt ", "\"There is something magical happening in #Wrocław, Poland.\" Find out what in our @suparnoban's latest blog. https://nokia.ly/2KmGz2h  #GoAllwhere #SmartCities", "Today, we signed a cooperative agreement to work with the city of #Wroclaw on their #smartcity platform which will set a solid foundation for innovations today and into their future. https://nokia.ly/2rLLQdt  #GoAllwhere @suparnoban", "We launch IoT Innovation Studio in Germany with @ATT. This new collaboration space will help solve business problems with #IoT solutions, foster a European ecosystem, and inspire #innovation. https://nokia.ly/32PW1ui  #5G", "Our @tommiuitto noted at #5GSmartCampus event: In the era of digital services, #5G and the automation of industries, open collaboration is critical to success. For us at @nokia openness is fundamental to who we are as a business. @NokiaGarage https://nokia.ly/33LtRSs  #industry40", "We are proud to be ranked as the top Self-Organizing Network & Optimization vendor by @IHSMarkit. Our SON solution enables operators to automate & efficiently realize the full potential of their existing networks, as well as drive transformation to #5G. https://nokia.ly/34YbB8E ", "We expand partnership with @VMware to ease large-scale, multi-cloud operations https://nokia.ly/2Xg8Zk4  #cloud #innovation #NFV", "Many of our past guests have discussed how much things are going to change when we finally have a global 5G network to work on. Today's guest is one of the folks responsible for laying the groundwork for that network -- Nokia's @stavares21 https://buff.ly/34VkaBa ", "Congratulations to Mona Dange and our legal & compliance team for receiving the 2019 #TrustLaw Collaboration Award in recognition of its contributions to the #probono legal project “Access to safe and lawful employment for refugees.” https://nokia.ly/2rBp5IZ  @TRF @Refugees #SDGs", "From 5G, Nokia Drone Networks, to Nokia 9 PureView, @MrWhoseTheBoss is all about exploring what’s the latest in tech!\nCheck out his experience with Nokia 9 PureView and discover how @Nokia’s drones are able to help first responders in mission-critical situations \n#TechPossible", "We were delighted to support @Rakuten to deliver live 8k video over #5G using our end-to-end solution together with NHK Technologies. Rakuten transmitted live 8k images from Tokyo to Chiba, and our 5G CPE was used to download the live 8k at #interbee2019. https://nokia.ly/2Xcc4la ", "Marseille Orange city powered by @nokia #5G", "The #SmartCity at #WCA19 was once again sponsored by @nokia. @totaltelecom spoke with CEO Cormac Wheelan ahead of the gala dinner https://youtu.be/Qi5Ygsq3alY  via @YouTube", "Excited to share that we help @Spectranet_NG, Nigeria’s largest Internet Service Provider, to provide 100+ Mbps ultra broadband services with FTTH to home and business users in Nigeria. Read more here: https://nokia.ly/2QentPJ ", "Just In: We've joined @sendai_kiki in the world's first test of #privatewireless connected drones for announcing tsunami evacuation alerts. Read more here: https://nokia.ly/2Qa52fd  #GoAllwhere", "Together with @sendai_kiki we have conducted the world's first #drone flight using a #privateLTE #mobilebroadband network for flight control and transmission of video and audio to make tsunami evacuation alerts. https://nokia.ly/2pdQVdG  #GoAllwhere", "In a partnership with @Microsoft, we're offering a #privateLTE and #IoT bundle for operators and enterprises with @bt_global as the first operator to sign on! Read more from @EIoTinsights https://nokia.ly/34yZNtg  #Industry40", "Speaking at #Winnovate2019, our Rajeev Suri said that turning traditional cities into #smartcities could improve key quality-of-life indicators, such as commuting time and air pollution, by up to 30%.  @WiproEvents @Wipro #innovation #5G https://nokia.ly/2CCTI2V ", "Congrats to Jarno Pajunen who was awarded the prize for European Smart Mobility Manager of the Year. Our fleet strategy combines travel, fleet, mobility & commuting ensuring affordable TCO & reduced carbon footprint. #FleetEuropeSummit #FleetEuropeAwards https://nokia.ly/2X0WJUp ", "We join the Broadband Commission @UNBBCom and @WorldBank call for all stakeholders to come together and collaborate to realize universally affordable access to the internet for all Africans. https://nokia.ly/2PhMvgw  #ConnectAfrica @_AfricanUnion #AfricaCom #connectivity #SDGs", "Join us at #AfricaCom and see how you can take #5G from ordinary to extraordinary. We’ll be waiting for you at booth C95 at Cape Town’s CTICC 12–14 November! https://nokia.ly/2PZoafC  @Connects_Africa", "According to @AnalysysMason, @nokia overtook the competition to lead the USD66.1 billion telecoms software and services market in 2018. Read the article. #NFV #SDN #5G", "Marseille #5G Orange city powered by @nokia", "We recently partnered with @ATT at the #Friends25 Anniversary Celebration event to show how their #5G network will give their customers the bandwidth to stream the iconic hit TV show in newly remastered 4K direct to their mobile devices. https://nokia.ly/2Q3GXGK  #FriendsxATT", "Did you know that Nokia’s drones are able to help first responders in mission-critical situations? Watch @mrwhosetheboss test Nokia Drone Networks in the Finnish wilderness and beyond to see what’s #TechPossible: https://youtu.be/OSRY-bJknqs !", "Our Espoo HQ Garage has collaborated with @AaltoUniversity and @startnorth to support the  educational “5G Mökki” concept. Join us for the #VR #AR experience, enabled by #5G #smallcells at our campus, soon to be featured at shopping centers. Read more: https://nokia.ly/2PYT2gv ", "Nokia female leaders shared an amazing experience in Copenhagen (Denmark) with representatives of #TDCGroupDK, #LEGO, #DanskeBank, #UN_Women and #Ørsted talking about #Diversity, #Sustainability, #Innovation, operational excellence and much more. Thank you!#WomenInTech #TeamNokia", "In a @WebSummit panel our Ursula Soritsch-Renier noted that artificial intelligence is so much fun, and we are only scratching the surface of what #AI can do. But before we embark on an AI mission we need to understand what we want to solve. https://nokia.ly/2qujxQd  #WebSummit", "Operators who take #security seriously in this #5G era will represent a much more compelling prospect for companies wishing to digitalize their services. Learn more about securing a network without borders in our blog: https://nokia.ly/36DkI03 \n#5Gsecurity #Nokia5G", "Ursula Soritsch-Renier announced at #WebSummit our plans to open a new IT Center of Excellence and hire more than 100 IT experts in Portugal to support growth plans. #5G #cloud #IoT https://nokia.ly/32s2hbs  @antoniocostapm", "Hooray! We won the #SmartCity Initiative of The Year Award from @COMMSMEA for our driver behavior analytics solution, which helps eliminate threats that originate from driver behavior as well as inadequate road conditions and traffic design. https://nokia.ly/34ztRox  #AI", "At the #WebSummit today, @MarcusWeldon explored a fundamental issue facing humanity: the pursuit of knowledge and that pursuit’s implications for the future of industry. To learn how we will leverage this, visit: https://nokia.ly/36AgW7P  and https://nokia.ly/2pJ4sdr  #4IR #5G", "In his LinkedIn Pulse post, our Dennis Lorenzin reflects what it takes to create the right telco #AI ecosystem, incl. our strategic collaboration with @Microsoft to accelerate transformation and #innovation across industries with #cloud, #AI and #IoT.", "We are leading the creation of physical and data infrastructure for #smartcities together with a large number of multidisciplinary group of companies and research groups. Read more: https://nokia.ly/2JUZ269  #LuxTurrim5G #5G #IoT @BellLabs", "Whilst most innovations thus far have catered to consumers, the #5G phase of the mobile internet will be driven by industry. Join our @MarcusWeldon on 6 November at #WebSummit to learn how #5G networks will affect the industrial space as well as society. https://nokia.ly/329idiG ", ".@nokia is thrilled to support the fundamental changes in the way we play, work and live through advanced 5G technology and partnership with @verizon  on important industry initiatives.", "Our Ursula Soritsch-Renier will join the Corporate #Innovation Summit panel to discuss how #AI is used for today, what are the plans for tomorrow, and how to get there. https://nokia.ly/2qRr6R5  #WebSummit", "Microsoft and @Nokia collaborate to accelerate digital transformation and Industry 4.0 for communications service providers and enterprises http://msft.social/8Mr311 ", "According to @AnalysysMason, @nokia overtook the competition to lead the USD66.1 billion telecoms software and services market in 2018. Read the article. #NFV #SDN #5G", "At Nordic @globalcompact meeting our Nassib Abou-Khalil emphasized the need for trust, fairness, proportionality and respect to be codified through collective debate and societal and cultural decisions. Read more about our approach: https://nokia.ly/2NhusFP  #ethics #SDGs #HRDD", "Today we announced the first joint solutions combining @Microsoft #cloud, #AI and machine learning expertise with Nokia’s leadership across #missioncritical networking and communications. https://nokia.ly/32fcJ5V  #MSIgnite #GoAllwhere #industry40", "Today we announced a strategic collaboration with @Microsoft to accelerate digital transformation, bringing Industry 4.0 across industries with #5G, #cloud, #AI and #IoT. https://nokia.ly/2PUtAJ3  #MSIgnite @MS_Ignite #industry40", "Speaking at #WebSummit, @MarcusWeldon’s formula for the future: proximity + productivity = real knowledge = human happiness  https://nokia.ly/36AgW7P ", "Our @MarcusWeldon @BellLabs will join #WebSummit on 5 November at 10:15 AM in Lisbon to address the future of human existence: proximity, productivity and the pursuit of happiness. https://nokia.ly/2N79I3j  #innovation", "Being #HealthierTogether and promoting life is all what #TeamNokia Wroclaw (Poland) is about! #ThinkPink #BreastCancerAwarenessMonth ", "Transforming stadium experiences from just being a spectator to being spectacular. That’s a #5G network that mobile operators can really capitalize on. Explore new ways to monetize your 5G network experiences. https://nokia.ly/2PKEq3X \n#Extraordinary5G #Nokia5G", "Our 5G radio engineers and the 5G marketing queen  @aceratti you can feel the fantastic energy of this team @nokia @nokianetworks #Futurecom2019 #Nokiafuturecom2019", "Congratulations to @Optus on your #Optu5G official launch - we’re delighted to be delivering the extraordinary in #5G to your customers. https://nokia.ly/2C8Ggnm ", "We are delighted to be recognized by @Proliitto for our efforts to close the unexplained pay gap. Read the PR: https://nokia.ly/33cBIbq  Read the blog post by our Rajeev Suri: \"Investing in #equality\" https://nokia.ly/32fDqHG  #SDGs #diversity @NokiaCareers", "#5G is an incredible technology with incredible potential. Our Mike Murphy speaks with @mobileworldlive.", "Our Balazs @Bertenyi, Chairman of @3GPP RAN, urges more cooperation on #5G Standards and recognizes individuals for their contributions.\n\nBlog https://nokia.ly/34h6OyL \n#3GPPLive https://www.3gpp.org \n5G Standards https://nokia.ly/2pT6s2o \n5G Patents https://nokia.ly/2Jsb6vt ", "We believe that a diverse workforce is our platform for greater #innovation, superior organizational performance, and delivering excellent service to our customers. https://nokia.ly/2MpngIk  #industry40 #diversity #UNIDOgender #SDGs @BellLabs @NokiaCareers", "We have established a relationship with @Innventure1 to accelerate commercialization of disruptive Nokia @BellLabs #satellite communications technology and intellectual property in areas beyond our core businesses. https://nokia.ly/2WFZgmB  #innovation #IPR", "Whilst most innovations thus far have catered to consumers, the #5G phase of the mobile internet will be driven by industry. Join our @MarcusWeldon on 6 November at #WebSummit to learn how #5G networks will affect the industrial space as well as society. https://nokia.ly/329idiG ", "Our #5G roadshows with @verizon has covered 1,500 enterprise and public sector customers this year. See how businesses in North America are ready for 5G and how we jointly celebrate #5GinAction. #innovation", "Our Balazs @Bertenyi, Chairman of @3GPP RAN, urges more cooperation on #5G Standards and recognizes individuals for their contributions.\n\nBlog https://nokia.ly/34h6OyL \n#3GPPLive https://www.3gpp.org \n5G Standards https://nokia.ly/2pT6s2o \n5G Patents https://nokia.ly/2Jsb6vt ", "Our @MarcusWeldon @BellLabs will join #WebSummit on 5 November at 10:15 AM in Lisbon to address the future of human existence: proximity, productivity and the pursuit of happiness. https://nokia.ly/2N79I3j  #innovation", "We are showing at #Futurecom2019 the 1st #5G Autonomous #robot #industry40 in Latin America with @OmronAutomation @UR_Latam @TIMBrasil @spiintegradora @Ladder_BR https://nokia.ly/2r37c5N ", "We're launching Netguard Adaptive Security Operations for the #5G era. Read more: https://nokia.ly/34jXKJG ", "Great news from Brazil! @nokiaindustries @Fiesp @mctic @governosp @anatel_oficial @BusinessFinland", "Congrats to Nassib for this special recognition! #diversity", "Our @luiztonisi @nokia on the new business models that 5G will bring: “we need flexibility and be fast to capture the opportunities.” #Futurecom2019 #nokiafuturecom2019", "Woo-hoo! We're quite proud our #WCA19 award winning Nokia AVA which enables #AI powered experiences. It's great for optimizing the existing network, for instance, or planning the deployment of new #5G use cases.\nhttps://nokia.ly/2MEusiA ", "We signed an agreement of coop with the Polish Ministry of Digital Affairs to support its #Cybersecurity Strategy. With 6000 employees in #Poland, a dedicated end-to-end Security Competence Center & #Security R&D in the country, we are well positioned to support the program. #5G", "About 80% of a mobile network's energy is consumed by base station sites. Liquid cooling can reduce energy consumption by up to 50%! Interesting to see Liquid Cooling demo at @Nokia Executive Experience Center with governmental visitors https://www.nokia.com/networks/technologies/zero-emission/ … #Sustainability #5G", "In a #CSCEE19 panel, our Richard Cooper emphasized that as a part of a #SmartCity as a Platform approach, end to end #cybersecurity measures must be implemented from Day 1 and embedded by design with the right design governance structures. https://nokia.ly/2Pwbv3N  #CSEU19 #5G", "Our @MarcusWeldon will explain, “Why #5G will change everything” as the 5G phase of the mobile internet will be driven by industry at #WebSummit Lisbon, 6 Nov at 12:45pm. https://nokia.ly/33pl4Fc \n\n5G Standards: https://nokia.ly/2pT6s2o \n5G Nokia: https://nokia.ly/2HTK0No ", "\"Nokia has serious environmental credentials. We were among the first 100 companies to say we'd reduce our emissions in line with the Paris agreement.\" said Rajeev Suri at #Futurecom. Read his blog about our commitment to a cleaner world: https://nokia.ly/32VJSVD  #5G #CSR #SDGs", "\"#4IR and #5G will enable immense productivity growth, in which economies will see productivity jump by around 30-35%. This starts around 2028 in the U.S., then in China, India, and elsewhere.\" says our Rajeev Suri in his #Futurecom keynote. https://nokia.ly/2Nm2Myf  #Futurecom2019", "Our Rajeev Suri speaking at #Futurecom: #Industry40 will create a triple whammy of revolutions with the potential to “green” our society:\n•Economic revolution \n•Environmental revolution \n•Telecommunications revolution \nhttps://nokia.ly/337zaew  #5G #CSR #SDGs", "Meet #TeamNokia at #Futurecom2019. Join us at our booth F131 for the extraordinary #5G experience. \nhttps://nokia.ly/2JxKfxO ", "We're at #TeliaDayOne to showcase with @teliafinland how enterprises can benefit from #5G, #FWA, #SDWAN and how to keep operations secure. Oh, and Tellu also leisurely strolled by. Not there? See her in her normal habitat in this blog: https://nokia.ly/34bOzuw  #5GinAction", "We have to make the urban digital transformation human-centric and secure-by-design to ensure our world’s #SecureDigitalDNA. Together we can build secure and safe #smartcities and regions. Our Richard Cooper joins the discussion in Poland. https://nokia.ly/2qH9vLB  #CSCEE19 #CSEU19", "We have signed a contract with @triindonesia to provide #IoT coverage to enterprises in Indonesia utilizing the fully virtualized Nokia Worldwide IoT Network Grid (WING). This will allow launching end-to-end IoT solutions quickly, reliably and affordably. https://nokia.ly/32Qj2OB ", "#Trust is critical in the #5G era. But how can you achieve this with networks managing 10x more connected devices than today? Our Rajeev Suri shares his views: https://nokia.ly/2JtKV7w \n#security", "Our Ursula Soritsch-Renier will join the Corporate #Innovation Summit panel to discuss how #AI is used for today, what are the plans for tomorrow, and how to get there. https://nokia.ly/2qRr6R5  #WebSummit", "See how the home of the future will look with #5G. With broadband services delivered wirelessly to the home, everything from 4K TV to VR gaming will be completely wire-free. https://nokia.ly/33UCsmz \n#5GOpportunities #VRGaming", "Nokia Launches New Time-sensitive Packet-optical Switches for 5G Cloud RAN", "Our Edouard Castellant today at for the launch of #TransatJV with @ATRacing99 talking about the set up of the #5G lab in le Havre #SmartPortCity. https://nokia.ly/362FS7E  #GoAllwhere @BMaurand #TGV2019", "We are developing disruptive #research for the next phase of human existence with our teams around the world. Watch what is like to work, innovate and play at @Nokia and Bell Labs. #PhD #postdoc #science", "We are looking for teams that can secure the future #digital society with #5G. Join the 5G #CyberSecurity #Hackathon and register by Friday November 1! https://nokia.ly/2Pmf0tA  Apply now: https://nokia.ly/2Jo5rWS  @TraficomFinland @CERTFI #5GCyberHack", "Ghosts and goblins come to play on this October day... You can win the battle and defeat #WiFi disruption this #Halloween. Watch the video: https://nokia.ly/2PvpLd9 ", "Our Rajeev Suri will give a keynote at #FutureCom in São Paulo on 29 October, and discuss the sustainable revolution with #5G and #industry40. https://nokia.ly/2WbMhsy  #SDGs #sustainability @FuturecomEvento", "Next week we will be at #Futurecom2019 - the main industry event in Latin America. Join us in Sao Paolo and learn about the business opportunities #5G has to offer. @FuturecomEvento https://nokia.ly/2pVmtEV \n#Futurecom", "Our @stavares21 sat down with @mobileworldlive at #MWC19 to provide an update of #5G market momentum and the opportunities it offers. #5GinAction", "We have to make the urban digital transformation human-centric and secure-by-design to ensure our world’s #SecureDigitalDNA. Together we can build secure and safe #smartcities and regions. Our Richard Cooper joins the discussion in Poland. https://nokia.ly/2qH9vLB  #CSCEE19 #CSEU19", "Proud to launch #Lublin real life #5G trials with @nokia in the presence of Mister Mayor Krzysztof Żuk https://biuroprasowe.orange.pl/informacje-prasowe/rozpoczelismy-testy-5g-w-lublinie-orange-polska-i-nokia-uruchomily-w-miescie-siec-10-stacji-bazowych/ …", "With @Orange_Polska we have launched a large-scale #5G test in the city of Lublin, Poland as part of the next stage of network trials in the country. https://nokia.ly/2N9GFep  @fallacher @prezydentZuk #5GinAction", "We join the Broadband Commission @UNBBCom and @WorldBank call for all stakeholders to come together and collaborate to realize universally affordable access to the internet for all Africans. https://nokia.ly/2PhMvgw  #ConnectAfrica @_AfricanUnion #AfricaCom #connectivity #SDGs", "We are honored to accept the #5G Prize from the Danish Energy Agency & @IDAdk! This award is recognition of our unique research collaboration & partnership w/ @aautech (DAPP) driving cellular standards innovation. https://nokia.ly/2BFpNH5 ", "That's a wrap #MWC19! Big thanks to #TeamNokia for the amazing show. See you next year at #MWC20. https://nokia.ly/365XT4Q ", "We had the honor of hosting Dr. Lisa Porter, the Deputy Undersecretary of Defense for Research and Engineering and her team experts today. #5G enables new technologies, promotes situational awareness and mission-critical decision making. #MWC19 https://nokia.ly/31KL10T ", "Find our Financial Report for Q3 and January-September 2019 here: https://nokia.ly/2WaGp2T  \n\nOur Q3 2019 Earnings Conference Call will take place today 24 October 2019 at 3 PM EET. https://nokia.ly/2WcjxzZ ", "Thank you @NevilleRay ! We're proud we can deliver the extraordinary in #5G to your customers.", "With @O2 we switch on 5G across London and Slough. O2’s customers will now have access to faster, more reliable connections as well as enjoying the benefits of #5G at iconic live event and sporting sites, including The O2 and Twickenham Stadium. https://nokia.ly/35WIxzI ", "Achieving the necessary #security level in the #5G era calls for predictive and automated operations. Visit us at #MWC19 and learn how our Adaptive Security Operations solution can help you protect your network.  https://nokia.ly/2oWFCXi ", "Thank you @Energistyrelsen and @IDAdk for awarding the newly established #5G prize in Denmark to @BellLabs & @aautech. Our Klaus Pedersen: “This award is a recognition of our unique research collaboration leading to #5G standards and use cases.” https://nokia.ly/2WcwU39 ", "Our #TeamNokia Cairo (Egypt) hosted an exciting #g4g with Greenlight for girls on a workshop full of science, designed to help female students from different schools get a closer view how we work at Nokia #GirlsinSTEM. ", "We are looking for teams that can secure the future #digital society with #5G. Join the 5G #CyberSecurity #Hackathon and register by November 1! https://5gcyberhack.fi  Apply now: https://ultrahack.org/5gcyberhack  @TraficomFinland @CERTFI #5GCyberHack", "We had an amazing Day 1 of our #Unix50 celebration and looking forward to a fantastic Day 2! Watch today's webcasts on YouTube!\n\n Overview: https://nokia.ly/2VMQra5 \n Schedule: https://nokia.ly/2M9DdkO \n YouTube: https://nokia.ly/2p7sUEV \n\nPlease share using #Unix50! #Unix #tech", "#5G operations need a new approach: #AI has the answers! https://nokia.ly/33U5d1S  @nokia #CognitiveCollaborationHubs #MWC19", "Would you like to learn how next generation networks will empower your digital journey? Join us at booth S.1002 during #MWC19 to learn the insights of #5G deployment. https://nokia.ly/2MGDBrj ", "Powerful end-to-end networks. Simplified and automated 5G operations. Amazing 5G customer experiences. Meet #teamNokia at #MWC19 in Los Angeles and learn how to experience and deliver the extraordinary in #5G. https://nokia.ly/2P4sVnT  @nokianetworks @nokiaindustries @BellLabs", "Watch our #Unix50 panels and talks TODAY!\n\n• Origin of #Unix (Brian Kernighan, Doug McIlroy, Peter Weinberger, Jon Bentley & Stephen Johnson) at 8:45am ET http://nokia.ly/2IZQJoV \n\n• Unix Kernel (Timothy Roscoe, Marina Thottan & Markus Hofmann) at 10am ET http://nokia.ly/2MPvhnJ ", "We are working towards realizing the future vision of mobile broadband communications. #Spectrum will  support of the future growth of IMT. #WRC19 #5G @ITU_R", "We showcased how to deliver the extraordinary in #5G at our Industry Analyst Day at #MWC19 Los Angeles. See the summary of #NokiaIAR moments with the analyst community and our experts.  “Nokia Industry Analyst Day at #MWC19 Los Angeles” by @nokia", "Our #Unix50 anniversary celebration event starts tomorrow!\n\nVisit us for broadcasts, blogs, history, resources & games!\n\n Overview: https://nokia.ly/2VMQra5 \n Schedule: https://nokia.ly/2M9DdkO \n#Unix #Linux #sysadmin #tech #IT #BSD #OSX #computer #software #SoftwareEngineer", "We are delighted to welcome the industry analyst community today to our #MWC19 analyst event in Los Angeles where we'll discuss how we deliver the extraordinary in #5G. Follow #NokiaIAR for participants' impressions and updates. https://nokia.ly/31yZT2d ", "#5G adoption is not a sprint, it’s the start of a 10-year marathon says our David Banjo in an article by @ngpcapital. He discusses the truths and myths of 5G deployment from a technical perspective.", "We are delighted to have been reconfirmed again as a constituent of the #Ethibel Sustainability Indices (ESI) Excellence Europe and Global for our #corporate #sustainability efforts. https://nokia.ly/2W9VyBH  Read more about our approach: https://nokia.ly/2nR8YWn  #CSR #SDGs", "We are delighted to announce the successfull purchase of the #Air2Gnd assets from @nokia - creating world’s first specialist for digital broadband networks for the #aviation industry https://www.linkedin.com/pulse/skyfive-completes-purchase-nokias-air-to-ground-assets-robrecht/ …", "Big day for Digital #Kazakhstan and #Shymkent. Nokia and Beeline launching 5G pilot in Shymkent. Proud to witness this moment.", ".@_Beeline_kz has launched a large-scale #5G network trial in Shymkent Kazakhstan. The end-to-end trial enabled by our 5G technology is integrated into Beeline’s live mobile network, making it one of the largest 5G trials in Central Asia. @VEONGroup https://nokia.ly/2BrHxp5 ", "We hosted the first #5G trial in the Northeast of Brazil together with @TIMBrasil and Virtus @UFCG_Oficial to deliver the extraordinary in Campina Grande. See the first remote-controlled connected tractor over #5G! https://nokia.ly/2MWtLQH  #5GinAction #VR #drones", "At #MWC19 Los Angeles, we demo AirScale All-in-Cloud BTS with fully virtualized and flexible baseband, for creating and monetizing lowest latency #5G services. Book your tour today. https://nokia.ly/2M8fFww ", "Streaming 4K video on the @ATT #5G network powered by @nokianetworks at the #FriendsxATT event in Las Vegas – at Las Vegas boulevard", ".@ATT and @nokia showcase #4K streaming in live commercial #5G network at ‘Friends 25th Anniversary’ celebration in Las Vegas Join us! https://nokia.ly/2J6PFj9  #immersive #AR", "We are looking for teams that can secure the future #digital society with #5G. Join the 5G #CyberSecurity #Hackathon and register by November 1! https://5gcyberhack.fi  Apply now: https://ultrahack.org/5gcyberhack  @TraficomFinland @CERTFI #5GCyberHack", "A warm thank you to @LoonForAll CEO, @awestgarthloon, for recognizing Nokia’s commitment to support Loon's mission to connect people everywhere. The award is made of an antenna circuit board, which spent time in the stratosphere before returning home! https://nokia.ly/32txpbx ", "Watch #Unix50 talks LIVE on Oct 22!\n\n• Origin of #Unix (Brian Kernighan, Doug McIlroy, Peter Weinberger, Jon Bentley & Stephen Johnson) at 8:45am ET https://nokia.ly/2IZQJoV \n\n• Unix Kernel (Timothy Roscoe, Marina Thottan & Markus Hofmann) at 10am ET https://nokia.ly/2MPvhnJ ", "It's time to create safer, more efficient and productive #mines through digital technologies. Join us at #8SAT2019 next week to learn how Nokia can help the #mining industry. https://nokia.ly/2nVdRxG  #GoAllwhere", "With @teliafinland we launch #5G network in the largest shopping center in the Nordics, delivering next-generation connectivity for consumers, businesses and entrepreneurs. https://nokia.ly/2Bl1I8b  @malloftripla #smallcells #FWA #retail", "Get a live look behind the scenes during our UnixWorld Challenge as our #interns and their @Nokia Bell Labs coaches prepare to compete.\n\nWatch our Facebook Live broadcast on Oct 21 at 4 ET and Oct 23 at 2:45pm.\n\n#Unix50 #Unix #sysadmin #tech #IT #BSD #OSX https://www.facebook.com/events/1382173981931255/ …", "Moving toward #AI? Read our executive summary on the state of AI in the telcoms industry. https://nokia.ly/2VPP76n ", "Nokia Deepfield wins Best Secured Network Initiative at the #BBWF Broadband Awards! \n\nThe portfolio helps operators improve the performance and security of the network, providing a better end user experience. https://nokia.ly/2J00vHF ", "Our Fuad Siddiqui @FuadBLC  of @BellLabs  emphasized how #5G networks can empower industries to boost performance and revenue.  See the video here: https://nokia.ly/2HTK0No  #mybroadbandconference #industry40", "#5G isn’t just the future. It’s the reality right now. And it’s extraordinary. Find out how our end-to-end solutions are built to deliver the extraordinary. https://nokia.ly/35GUGc4 ", "Take your #WiFi to any room. We deliver unrivalled whole-home WiFi with an exceptional customer experience. Come meet us at #BBWF to learn more: https://nokia.ly/2OHj72S ", "The award for Best Secured Network Initiative in the world today goes to… @Nokia! Congrats to the team at #BBWF! https://nokia.ly/32m9ydL ", "Our #Unix50 event with live streaming is only 6 days away! \n\nOverview : https://nokia.ly/2VMQra5   \nSchedule: https://nokia.ly/2M9DdkO   \nBlog: https://nokia.ly/33meQWI  \nPlay our #Unix Game: https://www.unixgame.io/unix50 \n#linux #sysadmin #tech #IT #BSD #OSX #computer #software", "#teamNokia showcased the extraordinary at #IMC2019. Powerful end-to-end networks. Simplified and automated 5G operations. Amazing #5G customer experiences. Thank you to all our customers & partners! @nokianetworks @nokiaindustries @NokiaCareers @exploreIMC https://nokia.ly/2MLJVMN ", "We collaborate with 2 leading universities in #Ethiopia to promote digital skills and #innovation, paving the way for world-class telecommunication services with advanced technologies including #4G and #5G https://nokia.ly/2qlo8UR ", "We join hands with @Wipro to develop #5G ecosystem in #India, Jayanta Dey of @Wipro and our Randeep Raina at #IMC2019. We will provide a live 5G end-to-end system, while Wipro will integrate its application solutions for 5G use cases. via @SwarajyaMag https://nokia.ly/32kBONS ", "Our Quillion chipset drives a new generation of NGPON solution, helping operators reduce power consumption and connect more people with higher speeds: https://nokia.ly/35yHoOC  #BBWF #5G", "’With Airtel and Nokia together, we can really make this happen a big success in India’ - Randeep Singh Sekhon, Airtel CTO about bringing #5G to India. #IMC2019 @airtelindia https://nokia.ly/2oLuBb4 ", ".@nokia at #IMC2019 with 10+ usecases on live 5G connectivity  - smart agriculture, future of factories with #Industry40 , immersive gaming, remote surgery for interactive #healthcare, virtual shopping experince with #AugmentedReality , virtual e-learning", "@TommiUitto of @Nokia knows that #5G isn’t just about faster, better phones — it’s also about the enterprise opportunity of #IoT. He can’t wait to see what operators do with it.", "Honourable minister @rsprasad along with @DoT_India visits @nokia booth to understand the demos & #technology showcased at #IMC2019. Explained by @MarwahAmit", "Business as Unusual – Sandy Motley, President of Nokia Fixed Networks, presents the keynote at #BBWF. https://nokia.ly/318wawE ", "#BBWF is in full swing! Learn more about intent-based networks, Nokia WiFi and how we can power your next-gen massive scale access network. https://nokia.ly/2VIv21J ", "Our @tommiuitto sharing insights and learnings about #5G deployment at @Qualcomm's #5GSummit, emphasizing the importance of a global end-to-end portfolio with security built in from the outset. #5GisHere #collaboration #innovation https://nokia.ly/2MFBFxO ", "It’s Day 2 at #IMC2019! Check out the Nokia smart factory. Powered by Airtel, this is the future of assembly. #AirtelatIMC", "How can #AI and cognitive #analytics address your key challenges? Get to know our Cognitive Collaboration Hubs which bring together the right people, technologies and processes leveraging #datascience expertise. @BellLabs #5G @Byrneingman @globaldataplc https://nokia.ly/33yamMJ ", "We're at @RAI_Amsterdam for #BBWF – welcome to our booth, where we'll show you how to increase your competitive advantage by delivering Gigabit services, and so much more! https://nokia.ly/35D17fV ", "\"Their are a myriad use cases of #5G and those once introduced, will change lives of people. The approach should be as to how to leverage this to change lives.\" Mr Sanjay Malik, Sr VP & Head of India Market, @nokia\n#IMC2019 #ExploreIMC #Besteventof2019 #ShotonHonor", "Three cheers for @triindonesia as we jointly complete first #5G end-to-end live network trial in #Indonesia! https://nokia.ly/2VELWyo ", "Our @MarcusWeldon will speak on, “The future of human existence: Proximity, productivity and the pursuit of happiness” at #WebSummit 2019 in Lisbon on November 5, 10:15am – 10:35am on the Future Societies stage at Altice Arena. #5G @WebSummit #websummit19 https://nokia.ly/2q8IKPL ", "Today was our first g4g Day @Cairo with @nokia! 70 girls joined us for a fun day with #STEM, from experiencing with #robotics to #plasmaphysics, we had a blast! #g4gCairo #g4gNokia #girlsintech #AnythingIsPossible #GirlsInSTEM #WomenInSTEM", "Intent-based automation is set to change the way the broadband business operates. And we have the industry's first solution. Read more: https://nokia.ly/327AVIm  #BBWF #5G", "\"We worked with the port of Germany to figure out what the containers are and know when a ship is coming and going, tracking containers. We at Nokia have a IOT grid\" CB Velayuthan, SR. VP Global Sales, @Nokia\n#IMC2019 #ShotOnNokia", "Get to know our speakers at #IMC2019: discussing innovation and #5G, and transferring society through #IOT and #Cloud. https://nokia.ly/32b3PHv ", "Join us at the India Mobile Congress next week and learn what our end-to-end portfolio of #5G equipment, software and services has to offer. See you at #IMC2019! https://nokia.ly/30WUqlD ", "With Hutchison 3, we complete first #5G end-to-end live network trial in #Indonesia. https://nokia.ly/35vV39c  @triindonesia @kemkominfo #mmWave #VoLTE", "Amb Vani Rao had a very memorable visit to Nokia's #5G 'factory of the future' in #Oulu  in Northern Finland, Nokia has an R & D centre in Bengaluru and is manufacturing 5G telecom equipment in Chennai ⁦@nokia⁩ ⁦@oulunkaupunki⁩", "Sanjay Malik: \"The future is #5G and it is now! We are enabling this future with connected cities, consumers and industries.\" Meet #teamNokia at #IMC2019 Oct 14-16 to experience the extraordinary in 5G. https://nokia.ly/2AYzgc9  @nokianetworks @nokiaindustries @belllabs @exploreIMC", "Get to know our speakers at #IMC2019: discussing innovation and #5G, and transforming society through #IoT and #Cloud. https://nokia.ly/324KYOs ", "Working together with @dutweets, du 5G network is live in the U.A.E. We are proud of our partnership, endorsed by Saleem AlBooshi, du CTO, to jointly create extraordinary experiences in #5G. See our #cloudgaming and #VR streaming use cases at #GITEX2019. https://nokia.ly/2M2nYKp ", "We're partnering up with Nokia and SRTIP to develop a range of innovative smart-city initiatives in Sharjah. We'll be working on concepts that will enhance Sharjah's digital transformation process. #FindUsWhereTheBlueIs #GITEX #Sharjah #SmartCity", "Ready to join the Gigabit broadband club? Join us at #BBWF to get started with Gigabit your Way. @RAI_Amsterdam https://nokia.ly/2mjgIzD ", "Why #5G points to a bright future in #Canada? Our Marc Bellini has the answers on @CalgarysBiz. #MWC19", "Nokia University starts its training courses in coop with the Moscow Technical University of Communications and Informatics @mtuci. More than 240 undergraduates and postgraduates have improved their competences since the project was launched in 2009. #VoIP #LTE #cloud #5G #Russia", "#DeliverTheExtraordinary with #Nokia5G. Discover how our unique end-to-end solutions are delivering extraordinary network performance. https://nokia.ly/329RvaJ  #5G", "We hosted #NokiaIAR event at our Cognitive Collaboration Hub in Vimercate, Italy to discuss & showcase network cognitive services strategy, latest use cases and delivery models. They will enable automated, agile, efficient network operations in #5G era. https://nokia.ly/32iIOdS ", "We have declared more than 2,000 patent families to @ETSI_STANDARDS as essential for the #5G standard, reflecting our continuing #leadership in cellular technology R&D and #standardization. PR: https://nokia.ly/2ARME1M  web page: https://nokia.ly/2pObmh4  @BellLabs #innovation", "Sanjay Malik: \"The future is #5G and it is now! We are enabling this future with connected cities, consumers and industries.\" Meet #teamNokia at #IMC2019 Oct 14-16 to experience the extraordinary in 5G. https://nokia.ly/2AYzgc9  @nokianetworks @nokiaindustries @belllabs @exploreIMC", "This week, #TeamNokia attended GITEX Technology week in Dubai to showcase our enterprise solutions. Here are some highlights! #GoAllwhere #GITEX2019 #5G @nokiaindustries", "Telia, Nokia Team Up to Bring 5G FWA to Customers in Finland https://ift.tt/2AYryyL ", "We are glad to partner with MTS @mts_news as it opens a #5G Center today in Moscow. Our end-to-end 5G network incl. Nokia AirScale serves as the foundation to develop and test digital services and various 5G scenarios, helping to develop the 5G ecosystem in Russia. #5GinAction", "Azfar Aslam of @BellLabs joined @Brendan_O2, @NorthumbrianH2O and other #O25G partners today in #O2BlueDoor panel. \"We are at an inflection point, where different technologies like #5G and #AI are confluencing and revolutionizing the industry processes.\" https://nokia.ly/2ny9EQd ", "Innovation at its finest.  @Nokia are using the low latency of 5G to power remote operations.\n\nIs this one of the most life-changing use cases of #5G? \n\n#O2BlueDoor #Innovation", ".@Nokia makes improvements to its @Qualcomm-powered Fastmile 5G Gateway which I saw when visiting @Optus in Australia. A great product for 5G Home broadband which now has a 4G variant and receiver that can be mounted outside.", "After an unprecedented four Broadband Awards last year, we are up for three more at #BBWF19. We are truly grateful! https://nokia.ly/2ImXcd8 ", "Continuous #learning is one of our set of core principles that drives who we are as a company. Sergio Fasce blogs how continually enhancing your knowledge and skill sets is a business essential for #renewal. https://nokia.ly/2AZ9hBy  @NokiaCareers #education", "Our FastMile fixed-wireless access solutions give broadband operators new tools in the toolkit to connect the unconnected. Read more: https://nokia.ly/2VrTT9Y  #BBWF #5G", "Join us at the India Mobile Congress next week and learn what our end-to-end portfolio of #5G equipment, software and services has to offer. See you at #IMC2019! https://nokia.ly/30WUqlD ", "#5G trial platforms in the 26 GHz band: we are participating in 6 projects out of the 11 projects selected by the French Government and @Arcep. https://nokia.ly/322ShpJ  #France #5GinAction", "New intent-based automation with our SDAN portfolio takes broadband industry another step towards fully autonomous networks: https://nokia.ly/2IBwfCV  #5G #BBWF", "As @teliafinland commercially opens 5G to the Finnish market today, we are proud to be working in partnership with them in providing the end-to-end #5G network incl. 5G-based Fixed Wireless Access broadband services to create extraordinary experiences. https://nokia.ly/35gjJlU ", "Working together with @dutweets, du 5G network is live in the U.A.E. We are proud of our partnership, endorsed by Saleem AlBooshi, du CTO, to jointly create extraordinary experiences in #5G. See our #cloudgaming and #VR streaming use cases at #GITEX2019. https://nokia.ly/2M2nYKp ", "We have declared more than 2,000 patent families to @ETSI_STANDARDS as essential for the #5G standard, reflecting our continuing #leadership in cellular technology R&D and #standardization. PR: https://nokia.ly/2ARME1M  web page: https://nokia.ly/2pObmh4  @BellLabs #innovation", "We are proud to be ranked as the top telecom #software business by market share in 2018 by @AnalysysMason. Our common software foundation is #5G-ready, cloud-native, multi-network, multi-vendor & optimized for the leading #cloud platforms. https://nokia.ly/2AVFqtq  #NFV #SDN", ".@nokianetworks showcases the @Avatour360 remote presence technology at the @GITEXTechWeek with @dutweets. Come try on a virtual headset and explore a faraway exciting location in real time using #5G technology #GITEX2019", "In support of #AdaLovelaceDay, we are proud to begin an annual tradition of shining a light on one of our current female innovators/researchers. Read the inspiring story about @BellLabs own Dr. Katherine Guo our 2019 Honoree. https://nokia.ly/2MjHmRU \n#FeelInspired #BetterTogether", "Quillion, our in-house designed chipset, drives a new generation of NGPON solution: https://nokia.ly/2nrVwbj  #5G #BBWF", "Can #AI be trained to beatbox? Watch as we explore the future of voice and AI in We Speak Music #TechPossible: https://nokia.ly/2LTpcaJ ", "We were happy to welcome Deputy Secretary-General Polawat Witoolkollachit from the Office of the National Digital Economy and Society Commission in #Thailand to discuss how #5G can benefit cities and industries. https://nokia.ly/33krk1d ", "During a recent press trip to Finland, @meeddubai\n spoke to @nokia about 5G networks and the adoption of these networks in the Middle East and Africa region. Read the full article: https://lnkd.in/dGXjZWe \n#Nokia #Telecoms #5G #Connectivity #Finland #Expo2020Dubai", "Even the most complex environments can be transformed by #5G. Read the Maravedis report on our 5G Smart Sea Port: https://nokia.ly/2ZWc9go ", "We are proud and honored to help @ZainKSA deploy the Middle East's largest #5G network using our end-to-end portfolio. via @ArabianBusiness", "Meet our @janerygaard at the #C40 debate on Oct 10 in Copenhagen, presenting how #5G goes hand-in-hand with #climate goals. Register: https://nokia.ly/2Ivde53  #TheFutureWeWant #Cities4Climate Not there? Read our commitment to limit global warming to 1.5°C: https://nokia.ly/2oj94Gk ", "@nokiaindustries is showcasing a 5g connected ambulance experience on our customer @NedaaDXB  at#gitex.", "As well as bringing power to rural communities, #utility companies can help them flourish by supplying broadband. Our Energy Innovation Lead, Liana Ault, talks about the wireless future of utility #broadband in her latest blog https://nokia.ly/30N8az0  #GoAllwhere #SmartUtilities", "#5G isn’t just the future. It’s the reality right now. And it’s extraordinary. Find out how our end-to-end solutions are built to deliver the extraordinary. https://nokia.ly/30MWwEn  #Nokia5G", "What to know about #5G? Our @stavares21 and @tnkgrl of Mobile Tech Podcast share their views with @ABC's @cathythorbecke.", "Vodafone makes Malta's first ever holographic call over #5G in collaboration with us. A live orchestra and band were joined on stage by two singers in #hologram form. @VodafoneMalta @MaltaPhil @ElectrikRed via @TheTimesofMalta https://nokia.ly/2VoKbW9 ", "As Finland & the US celebrate their century-long partnership, @niinisto & @realDonaldTrump agreed to strengthen coop in #innovation, #technology & research, especially in new technologies such as #5G and 6G, #AI, #robotics, and quantum computing. https://nokia.ly/2Mbybmv  #security", "Our #TeamNokia and greenlight for girls brought together 200 girls aged 11-15 from the local community in Ottawa (Canada), with the goal of demonstrating the link between #STEM to everything around us and to inspire the future generation of female STEM leaders. #g4gNokia", ".@realDonaldTrump said it well: @nokia @BellLabs is building a secure #5G for the U.S. in New Jersey. Nearly 100 years of #innovation and still going strong.  https://nokia.ly/2Oj4HGa ", "Save the Children felicitated Manisha Singh, CSR Head @nokia during the #TheRightStartSummit on 30.09.2019. We are grateful to Nokia for supporting our programme on Disaster Risk Reduction and Resilience Building among communities in A.P, Bihar, Delhi, Rajasthan & Tamil Nadu.", "As @USCellular announces first markets for #5G, we are proud to have played an important part in the modernization and deployment of the company’s 5G network through both hardware and software capabilities. https://nokia.ly/2nQNEA7 ", "We are pleased to again be in the top 1% of suppliers assessed by @ecovadis for corporate social responsibility, achieving particularly high scores in environment and sustainable procurement. See more recognitions here: https://nokia.ly/2nR8YWn  #CSR #sustainability #OurOnlyFuture", "Woo-hoo! We are celebrating twelve months of #5G ‘firsts’ across six continents and in a wide range of technology areas. Read more about the 23 game-changing achievements. https://nokia.ly/2nG9o1G \n#3GPP #massiveMIMO #industry40 #VR #IoT #mmWave #cloud", "#5G isn’t just the future. It’s the reality right now. And it’s extraordinary. Find out how our end-to-end solutions are built to deliver the extraordinary. #Nokia5G https://nokia.ly/2mGPao6 ", "A strong digital Europe is of critical importance for the future of the old continent!", "Our W Hackenberg at #IEEE5GSummit: “#5G will unlock the productivity gains of #Industry40. Having Nokia as your trusted technology partner you can realize its whole potential – across the country and in enterprises. We need to move fast and with courage to deploy 5G in Europe.”", "#5G field test successfully completed in the @PortOfHamburg: #Telekom, Hamburg Port Authority #HPA and  @nokia used the site as a test bed to prove the industrial capabilities of 5G. Find out more:  #IoT #logistics #hamburg", "Last call! Register now for our webinar on the #5G revolution: https://nokia.ly/2nBn8ul ", "We complete world’s 1st single-carrier terabit-per-second field trial over @etisalat's fibre network. A terabit-per-second is enough bandwidth to download the entire Game of Thrones video series in HD in under two seconds. https://nokia.ly/2mYA65k  #optical #transmission #capacity", "We have been selected as a primary partner to upgrade KDDI’s network from #4G network to #5G. This contract re-enforces the strong relationship between the two companies, which dates back over two decades. https://nokia.ly/2nJj23n  @kddipr #eMBB #industry40 #Japan", "For industries that rely on heavy machinery, #IIoT applications can streamline equipment maintenance and help keep workers safe. Find out how from our own Calvin Hennick on @CIOonline https://nokia.ly/2ndS2bR  #Industry40 #Mining #Manufacturing", "Our #TeamNokia in Amadora & Aveiro (Portugal) hosted #Nokia4kids, an annual event whose main goal is to promote the relationship between our employees and their families, this year’s thematic was Nokia as a strong contributor to a better society!", "\"This is my 10th year working for the company, and I would like to invite you for a journey to discover what I love the most about Nokia.\" Meet Paola, who's part of our #TeamNokia at Nokia Miami (USA), and experience with her what a day in a life at Nokia looks like!", "Our climate is in crisis. We need to act: reduce emissions, make more environmentally responsible choices and transition to cleaner energy. Read our CEO Rajeev Suri's blog how we are committing to a cleaner, more connected world. https://nokia.ly/2o0elSJ  #OurOnlyFuture #5G", "ICYMI: our new 5G Future X Lab in Espoo, Finland helps operators, enterprises and the industry ecosystem understand #5G end to end technology and its impact on business models. https://nokia.ly/2mlGe7x  #innovation @BellLabs @nokianetworks @nokiaindustries", "What will be possible in the future with #AI and voice? Watch as we explore the possibilities in We Speak Music: https://nokia.ly/2mSVCrU  #TechPossible", "Rajeev Suri was delighted to welcome Vietnamese Deputy Prime Minister Truong Hoa Binh and his delegation to discuss the opportunities in technological #innovation, #5G and #industry40. https://nokia.ly/2lFKH4w ", "Our Demetrio Russo welcomed guests to the opening of the first #5G Demonstration Zone in the Krasnodar Region in #Russia today to experience the extraordinary in #5G. @Beeline_RUS #VR #AR #gaming https://nokia.ly/2nMFlFb ", "ICYMI: we signed a revolving credit facility with its pricing mechanism linked to the our #sustainability targets such as reducing greenhouse gas emissions https://nokia.ly/2my43IU  #ClimateAction #environment #OurOnlyFuture", "Our @janerygaard and @stavares21 hopped on a robotic bus to discuss exciting use cases for #5G and dedicated networks. Join us for the ride! Watch the video: https://nokia.ly/2ns41mb  #5GinAction @sensible4ltd #LuxTurrim5g #5GinAction @nokianetworks @BellLabs @nokiaindustries", "Thank you to all our customers and partners for the intensive and insightful discussions at #NokiaRadioUG! We are excited to work with you to deliver the extraordinary in #5G. https://nokia.ly/2mWU0Ny  @nokia #teamNokia @BellLabs", "Our technology improves lives by providing access to education, information, better healthcare, and economic opportunity, and can enable a safer, smarter and healthier planet. Read more: https://nokia.ly/2mMX6nl  #ClimateAction #sustainability #environment #SDGs #5G #OurOnlyFuture", "Some glimpses from my address at @Nokia's Innovation Day celebration at their R&D center in Bengaluru. \n\nSpoke on why #Innovation is the need of the hour for every society & every generation and why we must embrace it. @CMofKarnataka", "Our @HarriHolma @BellLabs explains how to realize the full promise of #5G through 3GPP evolution at #NokiaRadioUG.  https://nokia.ly/2np6BcL  @3GPPLive", "We are honored to welcome Mr. Rajan S Mathews, DG COAI at the our Bangalore #Innovation Day today to present a keynote address on #5G. @ConnectCOAI https://nokia.ly/2litj5I ", ".@SparkNZ 5G wireless broadband is live in New Zealand with the first customers enjoying the benefits in Alexandra. The #Spark5G network uses the latest Nokia #5G radio equipment incl. a smart antenna system for optimised capacity & coverage. https://nokia.ly/2lgDUhu  @SparkNZNews", "Introducing The Hub....bringing you closer than ever before to Alex, the team, the new HUGO BOSS boat and the ground breaking technologies onboard. @BellLabs @nokia\nhttp://www.alexthomsonracing.com/the-hub \n#sailing #technology #VG2020 #VendeeGlobe #alexthomsonracing #NokiaBellLabs #Nokia", "Our #Sprint5G launches in #NYC, #LA, #PHX and #DC were successful thanks in part to our collaboration with @Nokia. Northeast Network VP @walkermarka talks about how this new network will benefit @Sprint customers. https://sprint.co/2Pi5XLL ", "Germany’s largest port handles 9 million containers a year. It’s a real test of #5G and network slicing. The results are unarguable and the possibilities are countless. Read more: https://nokia.ly/30cTkBE ", "Thank you @tommiuitto and @Nokia! It was an absolute pleasure to be at Nokia RadioActive talking all things #5G. What's next? Coverage - 5G for All #5GisHere", "Rajeev Suri blogs how we are committing to a cleaner, more connected world. There isn’t much time. The #climate crisis is real. But so are the weapons to fight it. Let’s start digitalizing our way to a better, cleaner, safer planet. #OurOnlyFuture #5G https://nokia.ly/2MdotQq ", "We harness #5G, #drones, #computervision & video analytics for monitoring blue-green algae at the Baltic Sea. #5G can help make a huge positive impact on #environment. https://nokia.ly/2IlXp0l  @teliafinland @SYKEint @VaisalaGroup @Nordkapp #OurOnlyFuture #ClimateAction #sdi19", "Our @SankariErja and Wolfgang Hackenberg were delighted to welcome German Minister-President Kretschmann of Baden-Württemberg at our Oulu factory today envisage the great opportunity for German #industry40 leaders in #5G powered #manufacturing. https://nokia.ly/2mRebwp ", ".@MarcusWeldon: \"Future X Lab enables @nokia customers to explore how a dynamically reconfigurable & automated #5G end-to-end network can increase network performance in areas of #latency, #capacity, reliability, #security and TCO.\" https://nokia.ly/2l379UG ", "Launched today: @nokia showcases its end-to-end #5G leadership with new Future X Lab in Finland, enabling customers to experience Nokia’s full end-to-end portfolio of 5G equipment, software and services. https://nokia.ly/2ljC2EE ", "In Mobile Networks, we are working hand in glove with @nokia @BellLabs and are taking the next leap in #5G development, including identifying and scouting the next big things in wireless, says our @tommiuitto at #NokiaRadioUG. https://nokia.ly/2mNhfd1  #innovation", "Rajeev Suri: \"#Industry40 will connect homes, factories, entire cities. Predictions suggest that there will be about 163 zettabytes of data transmitted annually by 2025, up from about 5 in 2014. Almost two-thirds of that will come from enterprises.\" https://nokia.ly/2m6r45p  #5G", "Rajeev Suri speaking to customers at #NokiaRadioUG: \"Research from @nokia and @AnalysysMason found that a large share of operators see #5G not only as a way to improve current services, but to provide entirely new revenue streams.\"  https://nokia.ly/2mzxeeN ", "Our Karoliina Loikkanen will join the Sustainable Impact Summit to contribute to #sustainableworld discussions & actions. We are proud to be part of a global movement setting more ambitious climate targets. 1.5˚C is #OurOnlyFuture https://nokia.ly/2mqZ3Wh  #sdi19 @wef @Davos", "‘Meaningful universal #connectivity’ to drive global development. is needed. @UNBBCom State of #Broadband report emphasizes urgent need to find new ways to reach the half of the world still unconnected. https://nokia.ly/2kytPfu  #ICT4SDG #GlobalGoals @ITU", "We step up commitments to do our part to limit global warming to 1.5°C. Connectivity and #5G will be essential tools to ensure that 1.5°C scenario is achievable. https://nokia.ly/351bp9A  #OurOnlyFuture #ClimateAction", "Rajeev Suri blogs how we are committing to a cleaner, more connected world. There isn’t much time. The #climate crisis is real. But so are the weapons to fight it. Let’s start digitalizing our way to a better, cleaner, safer planet. #OurOnlyFuture #5G https://nokia.ly/2MdotQq ", "Nokia #5G: green and cool! Meet @piatanska and @harkuo discussing our commitment to reducing power consumption and waste to fight against #climate change and enable a #ZeroEmissions digital future for society. #SDGs #ClimateAction #OurOnlyFuture", "Alex Thomson Racing & @Nokia Bell Labs have teamed up to push the boundaries of what man and machine can accomplish in extreme, mission-critical environments & to win the 24,000-mile @VendeeGlobe in 2020-21!\n\nTHE COUNTDOWN IS ON!\n\n#thisisBOSS @ATRacing99 #industrialautomation #5G", "Ahead of the @UN #ClimateAction Summit, we are proud to be part of a global movement of companies setting more ambitious climate targets. 1.5˚C is #OurOnlyFuture: https://nokia.ly/355Mp15 ", "World's first liquid cooled base station in a commercial network by @ElisaOyj, operational since 2018. Our @harkuo and @piatanska showcase this real-life use case at student housing in Helsinki. https://nokia.ly/2IgwVxa  #ZeroEmissions #ClimateAction #OurOnlyFuture", "Going green is positively good for businesses. @piatanska explains how we provide the technologies - such as #5G, #cloud platforms, #automation and #AI - that reduce emissions and connect our digital world. #climateaction #zeroemissions #OurOnlyFuture https://nokia.ly/2M2q8bK ", "We have over 130 customers using energy efficiency software features. Find out more about business benefits our technology brings to our customers and their businesses. #ZeroEmissions #ClimateAction #environment #SDGs #sustainability #5G https://nokia.ly/2IgtlDl ", "In advance of #ZeroEmissionsDay, learn how China Unicom achieved 84% less CO2 emissions and 84% less energy costs while #LTE data usage increased by 3.8 times by using our Single RAN, AirScale & #Cloud RAN, all easily upgradable by software to #5G. https://nokia.ly/34VJCr2 ", "Our Sandeep Girotra: “The #5G momentum is now in full swing and poised to help Asia to drive more intelligent innovations. To achieve this, stakeholders within the region’s connectivity ecosystem will need to be dynamic, flexible and responsive to #innovation.” @MilkenInstitute", "With Viettel we have broadcasted the first end-to-end #5G network in Ho Chi Minh City. The network will offer a range of real-time 5G end-user experiences and play a crucial role in enabling #Industry40 applications to boost Vietnam's economy. https://nokia.ly/2Ih2YgF ", "New HUGO BOSS yacht off to amazing start and more coming on the horizon with @nokia @BellLabs technologies @ATRacing99 @AlexThomson99 #VG2020 #VendeeGlobe #innovation #tech #nolimits", "The new HUGO BOSS.\n \nVendée Globe 2020?? Bring it on.    \n#launch #thisisBOSS #BOSSsports #alexthomsonracing #Nokia #NokiaBellLabs #oceanracing #sailing #IMOCA #thinkbig #VG2020 #VendeeGlobe\n@HUGOBOSS @nokia @BellLabs", "Our Edouard Castellant at the launch of Le Havre Smart Port City project in France presenting the future #5G lab to test industrial use cases in a harbour environment. https://nokia.ly/2M005BR ", "Our Jae Won talks about how #5G is foundation of 4th industrial revolution and the opportunities it opens for Asia Pacific and Japan in this video interview with @business @markets. \"We are focused on serving our customers.\" #industry40 @nokia https://nokia.ly/2IeJp8x ", "Largest 5G population coverage in the U.S.? Networks provided by Nokia!", "How will #5G transform consumer experiences so they become extraordinary: real-time, immersive, multi-collaborative, and utilizing #VR? Our @jre_elliott explains.  https://nokia.ly/30xskgF ", ".@Sprint’s @George76890605 dives into what makes #5G great today and how he sees it evolving & shaping the future of #Telecomm. Be sure to check out @Nokia’s podcast!", "Deliver the extraordinary. We are ready. Together with Verizon we showcase #5G in action in Dallas celebrating with customers excited to experience benefits that 5G will bring to their business. Read the blog by @stavares21 for more: https://nokia.ly/30r5NC3  #5GinAction", "Today our #TeamNokia celebrates Integrity Day 2019 at various sites around the world! An engaging opportunity to learn about our company's compliance program and to reinforce the principles that have made us one of the World’s Most Ethical companies. More: https://nokia.ly/2kjINpq ", "Game on with @A1Bulgaria! A1 Gaming League finals were played over Nokia #5G radio and CPE at Aniventure Comic Con 2019 in Sofia. The ultra-low #latency we provided impressed the players and enabled an exceptional mobile entertainment experience. #eSports https://nokia.ly/34Ohje1 ", "Building key enablers for a Digital Smart City. #LuxTurrim5G is a @BellLabs driven ecosystem project, opening new digital services and business opportunities for a real #smartcity. Find out more: https://nokia.ly/34OrwXL  @EspooEsbo @BusinessFinland @TraficomFinland #5G #innovation", "“#5G is already here, and with a potential for huge societal impact. And we should make it happen in India as soon as possible.” @MarwahAmit @nokianetworks at @VnDIndia #India5GEvolution", "Learn why #5G #smartroads are the future of #transport as demonstrated by our #LuxTurrim5G project in Espoo, Finland. \n\nLuxTurrim5G: https://www.luxturrim5g.com/ \n#transportation #smartcities #automatedvehicles #traffic #driverlesscars", "Thanks #Verizon for an amazing customer event in Dallas showcasing extraordinary 5G with #Nokia.", "How does #5G network deal with privacy related threat to mobile core network? @VarnaiZoltan shares insights: https://nokia.ly/34zEgBH ", "Candid briefing on #5G and #edge by #Nokia Marcus Weldon.", "Our @MarcVCop shares his insights about #5G with Maximillian Jacobson-Gonzalez at #ITUWORLD. We need policies to focus on providing more #spectrum fast & at a fair price, incentivizing infra investments incl. #smallcells and fiber, and sharing data. @ITU", "#ICYMI Our Future Human #Podcast: Episode 12, Vint Cerf says that Isaac Asimov’s 3 laws of #robotics should apply in some form to #IoT devices – it is important to design these systems so people have some ability to sense when they have crossed a red line. https://nokia.ly/2IhLj5N ", "#TeamNokia Bangalore (India) with @green4girls hosted an event with inspirational #STEM role models, the girls had a chance to dive into #5G technology, #IoT & other fun workshops.\n#girlsinSTEM #womenintech #WomenInSTEM #girlsintech #AnythingIsPossible #g4gDayBengaluru", "Don’t wait to set your #5G plan in motion. Our @jre_elliott has the word on how @nokia can help you scale up your network to capitalize on the 8 most important 5G use cases including one on #eHealth. #healthcare\n\nBlog: https://nokia.ly/31tg2XZ \n5G Use Cases: https://nokia.ly/2I7hJlX ", "Two weeks to go. Nokia Foundation grants available for PhD students, postdoc researchers and professors in the field of ICT. Note that the research shall have some affiliation to a relevant University in Finland. \nDeadline September 30", "ICYMI: With @docomo and @OmronAutomation we have agreed to conduct joint field trials using #5G at our plants. We will provide the enabling 5G technology, OMRON the factory automation equipment while NTT DOCOMO will run the 5G trial. #industry40 #IoT #IIoT https://nokia.ly/2I3AG91 ", ".@nokia & @telefonicaperu have signed a deal with #MMG’s #Minera #LasBambas to enable #digitalisation & #automation projects at the #mine in #Apurimac, #Peru. The contract will build & deploy a private #LTE #network 4,600 m above sea level #futureofmining http://bit.ly/2lU8Qnr ", "NEW: Together with @telefonicaperu, we’re enabling digital mining operations for Las Bambas, one of the world’s largest copper mines. The #privateLTE network will help make #mining safer, more efficient and productive https://nokia.ly/2I6n791  #GoAllwhere", "Today @megafonru tested #5G in #Russia. The tests included data transfer & packet connections, file downloads, voice & video calls, and were conducted using Nokia AirScale base station. Our joint test with MegaFon is an important milestone in building a 5G ecosystem in Russia.", "Our @MarcVCop shares his insights about #5G with Maximillian Jacobson-Gonzalez at #ITUWORLD. We need policies to focus on providing more #spectrum fast & at a fair price, incentivizing infra investments incl. #smallcells and fiber, and sharing data. @ITU", "Congratulations to our #TeamNokia in Hangzhou, Beijing, Nanjing and Chengdu for the successful organization of the 2019 Technical Festival. #5G, IoT, #AI, #Agile, #DevOps and Quality among other topics were shared by our Nokia specialists.", "#TeamNokia likes to play ball - and win the right games. #5G Take a look at our new HQ opening and sports day event with @basketfinland team members.", "What an amazing ‘Välkommen’! I’m beyond excited for what happens next. #MagentaMagic #5GForAll", "Keep your customers in the game. https://nokia.ly/34E0531  #5G #nationalgamingday #gamingday #gaming", "Gaming, uninterrupted. #5G https://nokia.ly/2LOxRd6  #gamingday #nationalgamingday", "Our Arne Deubelius receives a certificate of appreciation to @nokia from Houlin Zhao @ITUSecGen at #ITUWORLD. https://nokia.ly/306u0gF  @ITU", "Wondering how the opening of the New Nokia HQ in Espoo, Finland went? Check it out! ", "We're proud to be part of InDEx with other top industry players & academia striving to be the global leader in utilizing data & #AI. @dimecc_fi @Konecranes @Cargotec @Danfoss @fastems @PrimaPowerNA @RauteCorp @ssab @TietoCorp @TechFinland @BusinessFinland https://nokia.ly/34xVUWt ", "Markus Borchert, President of @Nokia Greater China and CEO of Nokia Shanghai Bell, took the stage at our World of Connections conference in Shanghai today  \n\nHe discussed how #5G will change the way we live and the role Nokia is playing in China’s 5G rollout.", "A full house at our HQ today to hear @TMobile’s magenta magic & plans to light up the market with #5G. We are with you to deliver the extraordinary in 5G! @NevilleRay @KKuoppamaki @mark_mcdiarmid @UlfEwaldsson Abdul Saad and Brian King #5GforAll #teamNokia https://nokia.ly/2LL7sx3 ", "Are you with us? @Nokia is! Just look at all that magenta!! Happy to be visiting the team that’s helping us build #5GForAll.", "Speaking at #ITUWORLD panel today, our @MarcVCop pointed out that while #5G can be considered the 5th generation of consumers' connectivity, it is essential to understand that it is also the 1st generation for critical industrial use case #connectivity. https://nokia.ly/34zIEAx ", "We’re excited to announce that today the pilot program for our self-driving shuttle bus GACHA begins in Kera, Espoo. \n\nThe program is a collaboration between Sensible 4, @nokia  and the city of @EspooEsbo\n#autonomousdriving #5G", "With @docomo and @OmronAutomation we bring #5G to the factory floor in Industry 4.0 trial https://nokia.ly/34Jp598  #IoT #industry40 #AI #robotics", "@bertenyi from @nokia explains in #ituworld how 3GPP standards work will continue to add value to 5G in years to come.", "Our @MarcVCop will join “#5G: the state of play” panel on September 10 https://nokia.ly/2ZKAllO  and speak about “#5G and Future Networks: creating an enabling regulatory environment through #publicprivate collaboration” on September 11 https://nokia.ly/2ZEUhXj  at #ITUWORLD. @ITU", "Our @LauriMTO @BellLabs emphasized in today's #ITUWORLD panel that #spectrum availability and harmonization is needed to give successful technologies the room to scale, and make #connectivity via these technologies affordable for everyone. https://nokia.ly/2ZZCRRn  #5G #IoT @ITU", "Mr Risto Siilasmaa, Chair of the Board of Directors @nokia gave a keynote speech on European competitiveness at the informal meeting of the High Level Working Group on #Competitiveness and #Growth. Chair of the #HLGcompet group @janne_kankanen welcomed @rsiilasmaa to the meeting.", "Our @LauriMTO @BellLabs will join a panel discussing \"Expanding access with new radio technologies\" at #ITUWORLD in Budapest today at 10:45am. #5G #IoT https://nokia.ly/2ZYbsz5 ", "Look forward to seeing you in Budapest for #ITUWorld, global tech event for governments, corporates, SMEs. Join at https://telecomworld.itu.int/take-part/register/ …", "Together with @SmartNewsroom, @pldt's mobile arm, we set our sights on bringing #Industry40 to Southeast Asia following a #5G standalone trial https://nokia.ly/2ZMlYhN  #networkslicing", "Missed the latest news from #IFA2019? Meet the new lineup and catch up on all the highlights right here. ​\n\n#NokiamobileLive", "Design to deliver flawless #5G experience on the go. https://nokia.ly/2ZrNT5G \n#gaming", "We're so happy to bring some science fun, and exchange with these amazing 150 girls today in #Bengaluru with @nokia! Want to have a look in all our #STEM workshops happening? #girlsinSTEM #womenintech #WomenInSTEM #girlsintech #AnythingIsPossible #g4gDayBengaluru", "#5G is an enabling technology for the factory of the future. See why and how it'll reform industries: https://nokia.ly/34x9v0e \n#5GOpportunities", "To prove the capabilities of its private wireless 4.9G & #5G networks, edge/cloud, and analytics technologies, @Nokia put them into play in Oulu, #Finland ( #ICFTop7 Community), base station pre-production facility. \n\nLearn more: https://buff.ly/2Tu6dFH ", "Our @LauriMTO will discuss how new technology, #5G and convergence affect broadcasting options at #ITUWORLD in Budapest on 9 September at 10:45am. He will suggest the use of UHF for mobile rural and similar coverage for bandwidth. @nokia @ITU https://nokia.ly/2UsY9pp ", "Today we were honoured to host Dr Phong, Mayor of Ho Chi Minh City and Dr Liem, Director of VNPT Vietnam Group at Nokia Executive Experience Center to discuss #5G for #SmartCities and see concrete demos like #AugmentedReality", "Watch our behind the scenes slideshow with 2018 Bell Labs Prize winners. Learn more about them: https://nokia.ly/2EgnbTu \n\nThe 2019 Bell Labs Prize will be awarded later this year. Learn more about the prize: https://nokia.ly/2FE96Nk  #PhD #phdchat", "Now live! Tune in as @NokiaMobile reveals a new lineup of Nokia phones to the world from #IFA2019. Watch here:", "Our @MarcVCop will join “#5G: the state of play” panel on September 10 https://nokia.ly/2ZKAllO  and speak about “#5G and Future Networks: creating an enabling regulatory environment through #publicprivate collaboration” on September 11 https://nokia.ly/2ZEUhXj  at #ITUWORLD. @ITU", "Today we're at @TraficomFinland #5Gmomentum seminar. With @teliafinland we have set up a #5G pop-up network. Come try it out during the break! You can also follow the presentations via live stream: https://nokia.ly/34o3dQd  @BellLabs @nokianetworks @lvmfi #5Gkärkimaaksi", "“It has become clear that great #5G runs on top of great #4G” explains our Deon Geyser in an interview with @ICIO_Africa when discussing the potential of 5G in #Africa. Read more: https://nokia.ly/34oCNOk ", "  The Nice Story is Nordic  Nordic CEOs for a Sustainable Future, @NordicCEOs, member companies #telecoms duo @Nokia and @Telia equipped #5G-connected #drones with #computer vision #tech to monitor environmental conditions in the Baltic Sea.", "“We always make sure we’re getting the best out of the network that we’re delivering to our customers.” says our @stavares21 in @rcrwirelessnews article as he outlines the success factors of @sprint #5G launch. https://nokia.ly/30XOgm6  #latency #massiveMIMO #VoLTE #4G", "As Nokia rolls out #5G on Verizon’s network, the two companies are paving the way to unleash a world of opportunities: https://nokia.ly/2lu5De7 \n#5G4B2B @VZEnterprise", "There is more to #5G than smartphones. Read about #5G Home broadband from Australia’s @Optus alternative using @Qualcomm-powered @Nokia’s 5G gateway. 5G CPE devices will spur additional adoption of 5G. https://www.ccsinsight.com/blog/the-5g-home-broadband-opportunity/ … – at Optus Centre Sydney", "We are proud to support @ru_mts in realizing the huge potential of 5G in #Russia. Today’s test in the #MTS #5G pilot nw with our equipment incl @nokia AirScale 5G system module & antenna systems is important in creating the 5G ecosystem in Russia. https://nokia.ly/34gtnED  #mmWave", "We did it again! For the sixth consecutive year, #TeamNokia was at #RunFest Helsinki with 23 teams. Being #HealthierTogether while supporting a great cause like saving the Baltic Sea is what we love! @jnurmisensaatio", "Iliad announces a strategic agreement with us for the deployment of its #5G network in France and Italy. The Group’s objective is to bring the best mobile connectivity to its some 17 million mobile subscribers in #France and #Italy. Read the PR: https://nokia.ly/2llr0yc ", "Find out why #drones are flying over the Baltic Sea: https://nokia.ly/2ZCgoxI \n#5G #environment @teliafinland @VaisalaGroup @SYKEinfo @Nordkapp #collaboration #innovation #ClimateAction", "Young minds getting a glimpse @nokia shaping the future. Celebrating Nokia's #University collaboration on future technologies & #Innovation on September 5 at our Bangalore (India) Campus. #NokiaStudents #5G #Industry40 #VR #ML #NokiaEducation", "We’re proud to be working with @vodafoneNZ team to bring #5G to New Zealand.", "Great news from @NokiaMobile!", "Through the recently signed MoU, we are proud to continue to support Saudi @McitGovSa in realizing @SaudiVision2030 with our innovations in #5G and #IoT and by building youth capabilities and local content. #innovation", "We harness #5G, #drones, #computervision & video analytics for monitoring blue-green algae at the Baltic Sea. #5G can help make a huge positive impact on #environment. https://nokia.ly/2ZwnLq7  @teliafinland @SYKEint @VaisalaGroup @Nordkapp #sustainability #SDG13 #ClimateAction", ".@TA_Group announces that @A1Telekom is streaming 8K video via #5G for the first time ever in #Austria during the @forumalpbach event with @nokia as its technology partner.  https://nokia.ly/2ZqHVlB ", "Kriengsak Wanichnatee CTO @AIS_Thailand and our Sebastien Laurent sign a MoU to research and test #5G technology to prepare for the development of industrial and consumer use cases  to strengthen the Digital Industry of #Thailand. PR in Thai language:  https://nokia.ly/2ZwALMp ", "We're hard at work and so proud to be working with you to deliver the extraordinary in a transformational @TMobile #5G network! @NevilleRay", "We deliver the extraordinary: earlier today we launched #5G in New York, Los Angeles, Washington DC, and Phoenix with @sprint. https://nokia.ly/2zo57Ch \n#5GInAction #Sprint5G", "Live from New York with @sprint: our Ricky Corker highlights high #5G performance in NY, LA, DC, and Phoenix with stringent 5G testing and lessons learned. \nhttps://nokia.ly/2UafDa0 \n#5GInAction #Sprint5G"]}